[Killed] BlockStatement
Harish/testing/src/lilypond.js:19:40
 // /**
 //  * @deprecated
 //  */
- const getLilypondHeader = function () {
-    return LILYPONDHEADER;
-};
+ const getLilypondHeader = function () {};
     function div(a, b) {
         return a / b;
killedBy: getLilypondHeader should return the header
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] BlockStatement
Harish/testing/src/lilypond.js:22:24
  const getLilypondHeader = function () {
     return LILYPONDHEADER;
 };
-    function div(a, b) {
-        return a / b;
-    }
+    function div(a, b) {}
     function increment(j) {
         return j+1;
killedBy: div should calculate correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ArithmeticOperator
Harish/testing/src/lilypond.js:23:16
     return LILYPONDHEADER;
 };
     function div(a, b) {
-        return a / b;
+        return a * b;
     }
     function increment(j) {
killedBy: div should calculate correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 45

[Killed] BlockStatement
Harish/testing/src/lilypond.js:25:27
     function div(a, b) {
         return a / b;
     }
-    function increment(j) {
-        return j+1;
-    }
+    function increment(j) {}
     function toFraction(d) {
         // Convert float to its approximate fractional representation.
killedBy: increment should increase the value by 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Timeout] ArithmeticOperator
Harish/testing/src/lilypond.js:26:16
         return a / b;
     }
     function increment(j) {
-        return j+1;
+        return j - 1;
     }
     function toFraction(d) {

[Killed] BooleanLiteral
Harish/testing/src/lilypond.js:30:20
     }
     function toFraction(d) {
         // Convert float to its approximate fractional representation.
-        let flip = false;
+        let flip = true;
         if (d > 1) {
             flip = true;
killedBy: toFraction should return the fraction
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   -4,
    2,

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:31:13
     function toFraction(d) {
         // Convert float to its approximate fractional representation.
         let flip = false;
-        if (d > 1) {
+        if (true) {
             flip = true;
             d = 1 / d;
killedBy: toFraction should return the fraction
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   -4,
    2,

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:31:13
     function toFraction(d) {
         // Convert float to its approximate fractional representation.
         let flip = false;
-        if (d > 1) {
+        if (d <= 1) {
             flip = true;
             d = 1 / d;
killedBy: toFraction should return the fraction
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   -4,
    2,

[Killed] BooleanLiteral
Harish/testing/src/lilypond.js:32:20
         // Convert float to its approximate fractional representation.
         let flip = false;
         if (d > 1) {
-            flip = true;
+            flip = false;
             d = 1 / d;
         }
killedBy: toFraction should return the fraction
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
    1,

[Killed] ArithmeticOperator
Harish/testing/src/lilypond.js:33:17
         let flip = false;
         if (d > 1) {
             flip = true;
-            d = 1 / d;
+            d = 1 * d;
         }
     
killedBy: toFraction should return the fraction
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
    1,

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:40:16
         let top = 1;
         let bot = 1;
     
-        while (Math.abs(df - d) >= 0.00000001) {
+        while (false) {
             if (df < d) {
                 top += 1;
killedBy: toFraction should return the fraction
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
+   1,

[Survived] EqualityOperator
Harish/testing/src/lilypond.js:40:16
         let top = 1;
         let bot = 1;
     
-        while (Math.abs(df - d) >= 0.00000001) {
+        while (Math.abs(df - d) > 0.00000001) {
             if (df < d) {
                 top += 1;

[Timeout] BlockStatement
Harish/testing/src/lilypond.js:41:25
         let bot = 1;
     
         while (Math.abs(df - d) >= 0.00000001) {
-            if (df < d) {
-                top += 1;
-            } else {
+            if (df < d) {} else {
                 bot += 1;
                 top = parseInt(d * bot);

[Survived] EqualityOperator
Harish/testing/src/lilypond.js:41:17
         let bot = 1;
     
         while (Math.abs(df - d) >= 0.00000001) {
-            if (df < d) {
+            if (df <= d) {
                 top += 1;
             } else {

[Timeout] BlockStatement
Harish/testing/src/lilypond.js:43:20
         while (Math.abs(df - d) >= 0.00000001) {
             if (df < d) {
                 top += 1;
-            } else {
-                bot += 1;
-                top = parseInt(d * bot);
-            }
+            } else {}
             df = top / bot;
         }

[Timeout] ArithmeticOperator
Harish/testing/src/lilypond.js:45:32
                 top += 1;
             } else {
                 bot += 1;
-                top = parseInt(d * bot);
+                top = parseInt(d / bot);
             }
             df = top / bot;

[Timeout] ArithmeticOperator
Harish/testing/src/lilypond.js:47:18
                 bot += 1;
                 top = parseInt(d * bot);
             }
-            df = top / bot;
+            df = top * bot;
         }
     

[Killed] BlockStatement
Harish/testing/src/lilypond.js:50:19
             df = top / bot;
         }
     
-        if (flip) {
-            const tmp = top;
-            top = bot;
-            bot = tmp;
-        }
+        if (flip) {}
     
         return [top, bot];
killedBy: toFraction should return the fraction
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
    1,

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:50:13
             df = top / bot;
         }
     
-        if (flip) {
+        if (false) {
             const tmp = top;
             top = bot;
killedBy: toFraction should return the fraction
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
    1,

[Killed] ArrayDeclaration
Harish/testing/src/lilypond.js:56:16
             bot = tmp;
         }
     
-        return [top, bot];
+        return [];
     }
 
killedBy: toFraction should return the fraction
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   2,
-   1,

[Killed] UnaryOperator
Harish/testing/src/lilypond.js:62:21
     function computeModeDef(mode, obj, lilypond, logo, turtle, key) {
         let modeDef = getModeDef(mode);
         let prevNote = getEmptyString();
-        let n, nn = -1;
+        let n, nn = +1;
         for (let ii = 0; ii < obj[1].length; ii++) {
             if (obj[1][ii] !== getEmptyString()) {
killedBy: computeModeDef should correctly compute the modeDef
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- major = #`((0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
+ major = #`((2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:63:26
         let modeDef = getModeDef(mode);
         let prevNote = getEmptyString();
         let n, nn = -1;
-        for (let ii = 0; ii < obj[1].length; ii++) {
+        for (let ii = 0; ii >= obj[1].length; ii++) {
             if (obj[1][ii] !== getEmptyString()) {
                 if (obj[0][ii].substr(0, 1) === prevNote) {
killedBy: computeModeDef should correctly compute the modeDef
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- major = #`((0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
+ major = #`()

[Killed] UpdateOperator
Harish/testing/src/lilypond.js:63:46
         let modeDef = getModeDef(mode);
         let prevNote = getEmptyString();
         let n, nn = -1;
-        for (let ii = 0; ii < obj[1].length; ii++) {
+        for (let ii = 0; ii < obj[1].length; ii--) {
             if (obj[1][ii] !== getEmptyString()) {
                 if (obj[0][ii].substr(0, 1) === prevNote) {
killedBy: computeModeDef should correctly compute the modeDef
statusReason: TypeError: Cannot read property 'substr' of undefined

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:64:17
         let prevNote = getEmptyString();
         let n, nn = -1;
         for (let ii = 0; ii < obj[1].length; ii++) {
-            if (obj[1][ii] !== getEmptyString()) {
+            if (false) {
                 if (obj[0][ii].substr(0, 1) === prevNote) {
                     modeDef = getEmptyString();
killedBy: computeModeDef should correctly compute the modeDef
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- major = #`((0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
+ major = #`()

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:64:17
         let prevNote = getEmptyString();
         let n, nn = -1;
         for (let ii = 0; ii < obj[1].length; ii++) {
-            if (obj[1][ii] !== getEmptyString()) {
+            if (true) {
                 if (obj[0][ii].substr(0, 1) === prevNote) {
                     modeDef = getEmptyString();
killedBy: computeModeDef should correctly compute the modeDef when obj[0][0] is in scale
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- major = #`()
+ major = #`((0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )

[Killed] BlockStatement
Harish/testing/src/lilypond.js:65:59
         let n, nn = -1;
         for (let ii = 0; ii < obj[1].length; ii++) {
             if (obj[1][ii] !== getEmptyString()) {
-                if (obj[0][ii].substr(0, 1) === prevNote) {
-                    modeDef = getEmptyString();
-                    break;
-                }
+                if (obj[0][ii].substr(0, 1) === prevNote) {}
                 scale = getExtendedScale()
                 n = scale.indexOf(
killedBy: computeModeDef should correctly compute the modeDef when obj[0][0] = "
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "
major = #`((0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
"

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:65:21
         let n, nn = -1;
         for (let ii = 0; ii < obj[1].length; ii++) {
             if (obj[1][ii] !== getEmptyString()) {
-                if (obj[0][ii].substr(0, 1) === prevNote) {
+                if (true) {
                     modeDef = getEmptyString();
                     break;
killedBy: computeModeDef should correctly compute the modeDef
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "
major = #`((0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
"
Received: ""

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:73:21
                 n = scale.indexOf(
                     obj[0][ii].substr(0, 1)
                 );
-                if (n > nn) {
+                if (false) {
                     // if (n - nn > 1) {
                     for (let j = nn + 1; j < n; j++) {
killedBy: computeModeDef should correctly compute the modeDef
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- major = #`((0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
+ major = #`((2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:73:21
                 n = scale.indexOf(
                     obj[0][ii].substr(0, 1)
                 );
-                if (n > nn) {
+                if (true) {
                     // if (n - nn > 1) {
                     for (let j = nn + 1; j < n; j++) {
killedBy: computeModeDef should correctly compute the modeDef
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- major = #`((0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
+ major = #`((-1 . ,NATURAL) (0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:75:42
                 );
                 if (n > nn) {
                     // if (n - nn > 1) {
-                    for (let j = nn + 1; j < n; j++) {
+                    for (let j = nn + 1; false; j++) {
                         modeDef += "(" + j + " . ,NATURAL) ";
                     }
killedBy: computeModeDef should correctly compute the modeDef
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- major = #`((0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
+ major = #`((1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )

[Killed] ArithmeticOperator
Harish/testing/src/lilypond.js:75:34
                 );
                 if (n > nn) {
                     // if (n - nn > 1) {
-                    for (let j = nn + 1; j < n; j++) {
+                    for (let j = nn - 1; j < n; j++) {
                         modeDef += "(" + j + " . ,NATURAL) ";
                     }
killedBy: computeModeDef should correctly compute the modeDef
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- major = #`((0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
+ major = #`((-2 . ,NATURAL) (-1 . ,NATURAL) (0 . ,NATURAL) (-1 . ,NATURAL) (0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL)

[Killed] StringLiteral
Harish/testing/src/lilypond.js:76:46
                 if (n > nn) {
                     // if (n - nn > 1) {
                     for (let j = nn + 1; j < n; j++) {
-                        modeDef += "(" + j + " . ,NATURAL) ";
+                        modeDef += "(" + j + "";
                     }
                     // }
killedBy: computeModeDef should correctly compute the modeDef
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- major = #`((0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
+ major = #`((0(1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )

[Killed] BlockStatement
Harish/testing/src/lilypond.js:80:50
                     }
                     // }
                     nn = n;
-                    if (obj[0][ii].length === 1) {
-                        modeDef += "(" + n + " . ,NATURAL) ";
-                    } else {
+                    if (obj[0][ii].length === 1) {} else {
                         if (obj[0][ii].substr(1, 1) === "♭") {
                             modeDef += "(" + n + " . ,FLAT) ";
killedBy: computeModeDef should correctly compute the modeDef
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- major = #`((0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
+ major = #`((2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:80:25
                     }
                     // }
                     nn = n;
-                    if (obj[0][ii].length === 1) {
+                    if (true) {
                         modeDef += "(" + n + " . ,NATURAL) ";
                     } else {
killedBy: computeModeDef n > 6
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- major = #`((0 . ,SHARP) (1 . ,SHARP) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
+ major = #`((0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )

[Killed] BlockStatement
Harish/testing/src/lilypond.js:82:28
                     nn = n;
                     if (obj[0][ii].length === 1) {
                         modeDef += "(" + n + " . ,NATURAL) ";
-                    } else {
-                        if (obj[0][ii].substr(1, 1) === "♭") {
-                            modeDef += "(" + n + " . ,FLAT) ";
-                        } else {
-                            modeDef += "(" + n + " . ,SHARP) ";
-                        }
-                    }
+                    } else {}
                 }
             }
killedBy: computeModeDef n > 6
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- major = #`((0 . ,SHARP) (1 . ,SHARP) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
+ major = #`((2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:83:29
                     if (obj[0][ii].length === 1) {
                         modeDef += "(" + n + " . ,NATURAL) ";
                     } else {
-                        if (obj[0][ii].substr(1, 1) === "♭") {
+                        if (obj[0][ii].substr(1, 1) !== "♭") {
                             modeDef += "(" + n + " . ,FLAT) ";
                         } else {
killedBy: computeModeDef n > 6
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- major = #`((0 . ,SHARP) (1 . ,SHARP) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
+ major = #`((0 . ,FLAT) (1 . ,FLAT) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )

[Killed] BlockStatement
Harish/testing/src/lilypond.js:83:62
                     if (obj[0][ii].length === 1) {
                         modeDef += "(" + n + " . ,NATURAL) ";
                     } else {
-                        if (obj[0][ii].substr(1, 1) === "♭") {
-                            modeDef += "(" + n + " . ,FLAT) ";
-                        } else {
+                        if (obj[0][ii].substr(1, 1) === "♭") {} else {
                             modeDef += "(" + n + " . ,SHARP) ";
                         }
killedBy: computeModeDef should correctly compute the modeDef when n > 6 (flat)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- major = #`((0 . ,FLAT) (1 . ,FLAT) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
+ major = #`((2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )

[Killed] StringLiteral
Harish/testing/src/lilypond.js:84:50
                         modeDef += "(" + n + " . ,NATURAL) ";
                     } else {
                         if (obj[0][ii].substr(1, 1) === "♭") {
-                            modeDef += "(" + n + " . ,FLAT) ";
+                            modeDef += "(" + n + "";
                         } else {
                             modeDef += "(" + n + " . ,SHARP) ";
killedBy: computeModeDef should correctly compute the modeDef when n > 6 (flat)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- major = #`((0 . ,FLAT) (1 . ,FLAT) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
+ major = #`((0(1(2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )

[Killed] BlockStatement
Harish/testing/src/lilypond.js:85:32
                     } else {
                         if (obj[0][ii].substr(1, 1) === "♭") {
                             modeDef += "(" + n + " . ,FLAT) ";
-                        } else {
-                            modeDef += "(" + n + " . ,SHARP) ";
-                        }
+                        } else {}
                     }
                 }
killedBy: computeModeDef n > 6
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- major = #`((0 . ,SHARP) (1 . ,SHARP) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
+ major = #`((2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )

[Killed] StringLiteral
Harish/testing/src/lilypond.js:86:50
                         if (obj[0][ii].substr(1, 1) === "♭") {
                             modeDef += "(" + n + " . ,FLAT) ";
                         } else {
-                            modeDef += "(" + n + " . ,SHARP) ";
+                            modeDef += "(" + n + "";
                         }
                     }
killedBy: computeModeDef n > 6
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- major = #`((0 . ,SHARP) (1 . ,SHARP) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
+ major = #`((0(1(2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )

[Killed] StringLiteral
Harish/testing/src/lilypond.js:86:40
                         if (obj[0][ii].substr(1, 1) === "♭") {
                             modeDef += "(" + n + " . ,FLAT) ";
                         } else {
-                            modeDef += "(" + n + " . ,SHARP) ";
+                            modeDef += "" + n + " . ,SHARP) ";
                         }
                     }
killedBy: computeModeDef n > 6
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- major = #`((0 . ,SHARP) (1 . ,SHARP) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
+ major = #`(0 . ,SHARP) 1 . ,SHARP) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:92:13
                 }
             }
         }
-        if (modeDef !== getEmptyString()) {
+        if (modeDef === getEmptyString()) {
             // if (n < 6) {
             for (let j = n + 1; j < 7; j++) {
killedBy: computeModeDef should correctly compute the modeDef
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

  ↵
- major = #`((0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
-

[Killed] BlockStatement
Harish/testing/src/lilypond.js:92:43
                 }
             }
         }
-        if (modeDef !== getEmptyString()) {
-            // if (n < 6) {
-            for (let j = n + 1; j < 7; j++) {
-                modeDef += "(" + j + " . ,NATURAL) ";
-            }
-            // }
-
-            modeDef += ")\n";
-            // console.debug(modeDef);
-            lilypond.freygish += modeDef;
-            logo.notationNotes[turtle] +=
-                " \\key " + key + " \\" + mode.replace(/ /g, "_") + "\n";
-        }
+        if (modeDef !== getEmptyString()) {}
         return modeDef
     }
killedBy: computeModeDef should correctly compute the modeDef
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

  ↵
- major = #`((0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
-

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:94:33
         }
         if (modeDef !== getEmptyString()) {
             // if (n < 6) {
-            for (let j = n + 1; j < 7; j++) {
+            for (let j = n + 1; j <= 7; j++) {
                 modeDef += "(" + j + " . ,NATURAL) ";
             }
killedBy: computeModeDef should correctly compute the modeDef
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- major = #`((0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
+ major = #`((0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) (7 . ,NATURAL) )

[Killed] ArithmeticOperator
Harish/testing/src/lilypond.js:94:26
         }
         if (modeDef !== getEmptyString()) {
             // if (n < 6) {
-            for (let j = n + 1; j < 7; j++) {
+            for (let j = n - 1; j < 7; j++) {
                 modeDef += "(" + j + " . ,NATURAL) ";
             }
killedBy: computeModeDef should correctly compute the modeDef
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- major = #`((0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
+ major = #`((-2 . ,NATURAL) (-1 . ,NATURAL) (0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )

[Killed] StringLiteral
Harish/testing/src/lilypond.js:95:38
         if (modeDef !== getEmptyString()) {
             // if (n < 6) {
             for (let j = n + 1; j < 7; j++) {
-                modeDef += "(" + j + " . ,NATURAL) ";
+                modeDef += "(" + j + "";
             }
             // }
killedBy: computeModeDef should correctly compute the modeDef
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- major = #`((0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
+ major = #`((0(1(2(3(4(5(6)

[Killed] StringLiteral
Harish/testing/src/lilypond.js:95:28
         if (modeDef !== getEmptyString()) {
             // if (n < 6) {
             for (let j = n + 1; j < 7; j++) {
-                modeDef += "(" + j + " . ,NATURAL) ";
+                modeDef += "" + j + " . ,NATURAL) ";
             }
             // }
killedBy: computeModeDef should correctly compute the modeDef
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- major = #`((0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
+ major = #`(0 . ,NATURAL) 1 . ,NATURAL) 2 . ,NATURAL) 3 . ,NATURAL) 4 . ,NATURAL) 5 . ,NATURAL) 6 . ,NATURAL) )

[Killed] StringLiteral
Harish/testing/src/lilypond.js:99:24
             }
             // }
 
-            modeDef += ")\n";
+            modeDef += "";
             // console.debug(modeDef);
             lilypond.freygish += modeDef;
killedBy: computeModeDef should correctly compute the modeDef
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

  ↵
- major = #`((0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
-

[Killed] StringLiteral
Harish/testing/src/lilypond.js:103:35
             // console.debug(modeDef);
             lilypond.freygish += modeDef;
             logo.notationNotes[turtle] +=
-                " \\key " + key + " \\" + mode.replace(/ /g, "_") + "\n";
+                " \\key " + key + "" + mode.replace(/ /g, "_") + "\n";
         }
         return modeDef
killedBy: computeModeDef should correctly compute the modeDef when mode has /
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 2

- undefined \key esisisiseses \major
+ undefined \key esisisisesesmajor
-  \key esisisiseses \major_/_/_//_//

[Killed] StringLiteral
Harish/testing/src/lilypond.js:103:69
             // console.debug(modeDef);
             lilypond.freygish += modeDef;
             logo.notationNotes[turtle] +=
-                " \\key " + key + " \\" + mode.replace(/ /g, "_") + "\n";
+                " \\key " + key + " \\" + mode.replace(/ /g, "_") + "";
         }
         return modeDef
killedBy: computeModeDef should correctly compute the modeDef when mode has /
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

- undefined \key esisisiseses \major
-  \key esisisiseses \major_/_/_//_//
+ undefined \key esisisiseses \major \key esisisiseses \major_/_/_//_//
