[Killed] LogicalOperator
Harish/testing/src/lilypond.js:114:13
         // And the octave bounday is at C, not A.
 
         // Convert frequencies here.
-        if (typeof note === "number" || typeof note == "object") {
+        if (typeof note === "number" && typeof note == "object") {
             const pitchObj = ["''", "'''"]
             // frequencyToPitch(note);
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: TypeError: note.replace is not a function

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:114:13
         // And the octave bounday is at C, not A.
 
         // Convert frequencies here.
-        if (typeof note === "number" || typeof note == "object") {
+        if (false) {
             const pitchObj = ["''", "'''"]
             // frequencyToPitch(note);
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: TypeError: note.replace is not a function

[Killed] StringLiteral
Harish/testing/src/lilypond.js:115:31
 
         // Convert frequencies here.
         if (typeof note === "number" || typeof note == "object") {
-            const pitchObj = ["''", "'''"]
+            const pitchObj = ["", "'''"]
             // frequencyToPitch(note);
             note = pitchObj[0] + pitchObj[1];
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] <= 0, typeof notes == obj, arr[1] = 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato 
+ < note ''' ''' '''>2.. \staccato < note ''' ''' '''>2.. \staccato < note ''' ''' '''>2.. \staccato

[Killed] ArithmeticOperator
Harish/testing/src/lilypond.js:117:20
         if (typeof note === "number" || typeof note == "object") {
             const pitchObj = ["''", "'''"]
             // frequencyToPitch(note);
-            note = pitchObj[0] + pitchObj[1];
+            note = pitchObj[0] - pitchObj[1];
         }
 
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: TypeError: note.replace is not a function

[Killed] StringLiteral
Harish/testing/src/lilypond.js:122:28
 
         return note
             .replace(/♮/g, "!")
-            .replace(/♯/g, "is")
+            .replace(/♯/g, "")
             .replace(/♭/g, "es")
             .replace(/10/g, "''''''''")
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ ~~~~~_\markup {} } ~~~~~} ~~~}

[Killed] StringLiteral
Harish/testing/src/lilypond.js:123:28
         return note
             .replace(/♮/g, "!")
             .replace(/♯/g, "is")
-            .replace(/♭/g, "es")
+            .replace(/♭/g, "")
             .replace(/10/g, "''''''''")
             .replace(/1/g, ",, ")
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ ~~~~~_\markup {} } ~~~~~} ~~~}

[Killed] StringLiteral
Harish/testing/src/lilypond.js:129:28
             .replace(/2/g, ", ")
             .replace(/3/g, "")
             .replace(/4/g, "'")
-            .replace(/5/g, "''")
+            .replace(/5/g, "")
             .replace(/6/g, "'''")
             .replace(/7/g, "''''")
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ ~~~~~_\markup {} } ~~~~~} ~~~}

[Killed] StringLiteral
Harish/testing/src/lilypond.js:130:28
             .replace(/3/g, "")
             .replace(/4/g, "'")
             .replace(/5/g, "''")
-            .replace(/6/g, "'''")
+            .replace(/6/g, "")
             .replace(/7/g, "''''")
             .replace(/8/g, "''''''")
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ ~~~~~_\markup {} } ~~~~~} ~~~}

[Killed] BlockStatement
Harish/testing/src/lilypond.js:136:34
             .replace(/9/g, "'''''''")
             .toLowerCase();
     }
-    function getTupletDuration() { return 2*10; }
+    function getTupletDuration() {}
     function __processTuplet(logo, turtle, i, count, nextObj, notes) {
         let j = 0;
killedBy: getTupletDuration should get the tuplet duration
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: undefined

[Killed] ArithmeticOperator
Harish/testing/src/lilypond.js:136:43
             .replace(/9/g, "'''''''")
             .toLowerCase();
     }
-    function getTupletDuration() { return 2*10; }
+    function getTupletDuration() { return 2 / 10; }
     function __processTuplet(logo, turtle, i, count, nextObj, notes) {
         let j = 0;
killedBy: getTupletDuration should get the tuplet duration
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 0.2

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:142:16
         let k = 0;
         let ii;
 
-        while (k < count) {
+        while (k <= count) {
             tupletDuration = getTupletDuration();
             // logo.notation.notationStaging[turtle][i + j][NOTATIONDURATION];
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+ \tuple 8/1 { } \tuple 8/1 { }

[Timeout] EqualityOperator
Harish/testing/src/lilypond.js:142:16
         let k = 0;
         let ii;
 
-        while (k < count) {
+        while (k >= count) {
             tupletDuration = getTupletDuration();
             // logo.notation.notationStaging[turtle][i + j][NOTATIONDURATION];

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:147:17
             // logo.notation.notationStaging[turtle][i + j][NOTATIONDURATION];
 
             // notes = logo.notation.notationStaging[turtle][i + j][NOTATIONNOTE];
-            if (typeof notes === "object") {
+            if (false) {
                 if (notes.length > 1) {
                     logo.notationNotes[turtle] += "<";
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ ~~~~~_\markup {} } ~~~~~} ~~~}

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:147:17
             // logo.notation.notationStaging[turtle][i + j][NOTATIONDURATION];
 
             // notes = logo.notation.notationStaging[turtle][i + j][NOTATIONNOTE];
-            if (typeof notes === "object") {
+            if (typeof notes !== "object") {
                 if (notes.length > 1) {
                     logo.notationNotes[turtle] += "<";
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: TypeError: Cannot read property 'length' of undefined

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:148:21
 
             // notes = logo.notation.notationStaging[turtle][i + j][NOTATIONNOTE];
             if (typeof notes === "object") {
-                if (notes.length > 1) {
+                if (notes.length >= 1) {
                     logo.notationNotes[turtle] += "<";
                 }
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ undefined~~~~~_\markup {} } ~~~~~} ~~~}

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:148:21
 
             // notes = logo.notation.notationStaging[turtle][i + j][NOTATIONNOTE];
             if (typeof notes === "object") {
-                if (notes.length > 1) {
+                if (false) {
                     logo.notationNotes[turtle] += "<";
                 }
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ undefined~~~~~_\markup {} } ~~~~~} ~~~}

[Killed] StringLiteral
Harish/testing/src/lilypond.js:149:51
             // notes = logo.notation.notationStaging[turtle][i + j][NOTATIONNOTE];
             if (typeof notes === "object") {
                 if (notes.length > 1) {
-                    logo.notationNotes[turtle] += "<";
+                    logo.notationNotes[turtle] += "";
                 }
                 for (ii = 0; ii < notes.length; ii++) {
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ undefined~~~~~_\markup {} } ~~~~~} ~~~}

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:151:30
                 if (notes.length > 1) {
                     logo.notationNotes[turtle] += "<";
                 }
-                for (ii = 0; ii < notes.length; ii++) {
+                for (ii = 0; false; ii++) {
                     logo.notationNotes[turtle] += __toLilynote(notes[ii]);
                     if (notes.length === 1 || ii < notes.length - 1) {
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ undefined~~~~~_\markup {} } ~~~~~} ~~~}

[Killed] UpdateOperator
Harish/testing/src/lilypond.js:151:49
                 if (notes.length > 1) {
                     logo.notationNotes[turtle] += "<";
                 }
-                for (ii = 0; ii < notes.length; ii++) {
+                for (ii = 0; ii < notes.length; ii--) {
                     logo.notationNotes[turtle] += __toLilynote(notes[ii]);
                     if (notes.length === 1 || ii < notes.length - 1) {
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ undefined~~~~~_\markup {} } ~~~~~} ~~~}

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:153:47
                 }
                 for (ii = 0; ii < notes.length; ii++) {
                     logo.notationNotes[turtle] += __toLilynote(notes[ii]);
-                    if (notes.length === 1 || ii < notes.length - 1) {
+                    if (notes.length === 1 || true) {
                         logo.notationNotes[turtle] += " ";
                     }
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ undefined~~~~~_\markup {} } ~~~~~} ~~~}

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:153:25
                 }
                 for (ii = 0; ii < notes.length; ii++) {
                     logo.notationNotes[turtle] += __toLilynote(notes[ii]);
-                    if (notes.length === 1 || ii < notes.length - 1) {
+                    if (notes.length !== 1 || ii < notes.length - 1) {
                         logo.notationNotes[turtle] += " ";
                     }
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ undefined~~~~~_\markup {} } ~~~~~} ~~~}

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:157:21
                         logo.notationNotes[turtle] += " ";
                     }
                 }
-                if (notes[6]) {
+                if (true) {
                     logo.notationNotes[turtle] += " \\staccato ";
                 }
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ undefined~~~~~_\markup {} } ~~~~~} ~~~}

[Killed] BlockStatement
Harish/testing/src/lilypond.js:157:31
                         logo.notationNotes[turtle] += " ";
                     }
                 }
-                if (notes[6]) {
-                    logo.notationNotes[turtle] += " \\staccato ";
-                }
+                if (notes[6]) {}
                 if (notes.length > 1) {
                     logo.notationNotes[turtle] += ">";
killedBy: __processTuplet when k < count, and notes is of type object when len of notes > 1
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: " \\staccato "
Received string:    "<''''' ''''' ''''' ''''' ''''' ''''' '''''>3<''''' ''''' ''''' ''''' ''''' ''''' '''''>3<''''' ''''' ''''' ''''' ''''' ''''' '''''>3<''''' ''''' ''''' ''''' ''''' ''''' '''''>3<''''' ''''' ''''' ''''' ''''' ''''' '''''>3)} "

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:160:21
                 if (notes[6]) {
                     logo.notationNotes[turtle] += " \\staccato ";
                 }
-                if (notes.length > 1) {
+                if (true) {
                     logo.notationNotes[turtle] += ">";
                 }
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ undefined~~~~~_\markup {} } ~~~~~} ~~~}

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:160:21
                 if (notes[6]) {
                     logo.notationNotes[turtle] += " \\staccato ";
                 }
-                if (notes.length > 1) {
+                if (notes.length <= 1) {
                     logo.notationNotes[turtle] += ">";
                 }
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ undefined~~~~~_\markup {} } ~~~~~} ~~~}

[Killed] UpdateOperator
Harish/testing/src/lilypond.js:165:17
                 }
 
                 logo.notationNotes[turtle] += "3"
-                j++; // Jump to next note.
+                j--; // Jump to next note.
                 k++; // Increment notes in tuplet.
             } else if (notes === "tie") {
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ undefined~~~~~_\markup {} } ~~~~~} ~~~}

[Timeout] UpdateOperator
Harish/testing/src/lilypond.js:166:17
 
                 logo.notationNotes[turtle] += "3"
                 j++; // Jump to next note.
-                k++; // Increment notes in tuplet.
+                k--; // Increment notes in tuplet.
             } else if (notes === "tie") {
             // else if (logo.notation.notationStaging[turtle][i + j] === "tie") {

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:167:24
                 logo.notationNotes[turtle] += "3"
                 j++; // Jump to next note.
                 k++; // Increment notes in tuplet.
-            } else if (notes === "tie") {
+            } else if (false) {
             // else if (logo.notation.notationStaging[turtle][i + j] === "tie") {
                 logo.notationNotes[turtle] += "~";
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ _\markup {} } } }

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:167:24
                 logo.notationNotes[turtle] += "3"
                 j++; // Jump to next note.
                 k++; // Increment notes in tuplet.
-            } else if (notes === "tie") {
+            } else if (notes !== "tie") {
             // else if (logo.notation.notationStaging[turtle][i + j] === "tie") {
                 logo.notationNotes[turtle] += "~";
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+ \tuple 8/1 { ~} \tuple 8/1 { ~} \tuple 8/1 { ~}

[Killed] UpdateOperator
Harish/testing/src/lilypond.js:170:17
             } else if (notes === "tie") {
             // else if (logo.notation.notationStaging[turtle][i + j] === "tie") {
                 logo.notationNotes[turtle] += "~";
-                j++; // Jump to next note.
+                j--; // Jump to next note.
                 k++; // Increment notes in tuplet.
             } else {
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: -3

[Timeout] BlockStatement
Harish/testing/src/lilypond.js:172:20
                 logo.notationNotes[turtle] += "~";
                 j++; // Jump to next note.
                 k++; // Increment notes in tuplet.
-            } else {
-                j++; // Jump to next note.
-                k++; // Increment notes in tuplet.
-            }
+            } else {}
         }
 

[Timeout] UpdateOperator
Harish/testing/src/lilypond.js:173:17
                 j++; // Jump to next note.
                 k++; // Increment notes in tuplet.
             } else {
-                j++; // Jump to next note.
+                j--; // Jump to next note.
                 k++; // Increment notes in tuplet.
             }

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:178:13
             }
         }
 
-        if (i + j - 1 < 10) {
+        if (i + j - 1 >= 10) {
             // const nextObj = logo.notation.notationStaging[turtle][i + j];
             // Workaround to a Lilypond "feature": if a slur
killedBy: __processTuplet when i + j - 1 < 10 nextObj === ")"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- )} 
+ }

[Killed] ArithmeticOperator
Harish/testing/src/lilypond.js:178:13
             }
         }
 
-        if (i + j - 1 < 10) {
+        if (i - j - 1 < 10) {
             // const nextObj = logo.notation.notationStaging[turtle][i + j];
             // Workaround to a Lilypond "feature": if a slur
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 7

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:183:17
             // Workaround to a Lilypond "feature": if a slur
             // ends on a tuplet, the closing ) must be inside
             // the closing } of the tuplet. Same for markup.
-            if (nextObj === ")") {
+            if (false) {
                 logo.notationNotes[turtle] += ")} ";
                 i += 1;
killedBy: __processTuplet when i + j - 1 < 10 nextObj === ")"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- )} 
+ }

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:183:17
             // Workaround to a Lilypond "feature": if a slur
             // ends on a tuplet, the closing ) must be inside
             // the closing } of the tuplet. Same for markup.
-            if (nextObj === ")") {
+            if (nextObj !== ")") {
                 logo.notationNotes[turtle] += ")} ";
                 i += 1;
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+ \tuple 8/1 { )} \tuple 8/1 { )} \tuple 8/1 { )}

[Killed] StringLiteral
Harish/testing/src/lilypond.js:184:47
             // ends on a tuplet, the closing ) must be inside
             // the closing } of the tuplet. Same for markup.
             if (nextObj === ")") {
-                logo.notationNotes[turtle] += ")} ";
+                logo.notationNotes[turtle] += "";
                 i += 1;
             } else if (nextObj === "markup") {
killedBy: __processTuplet when i + j - 1 < 10 nextObj === ")"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- \meter
- )} 
+ undefined

[Killed] BlockStatement
Harish/testing/src/lilypond.js:186:46
             if (nextObj === ")") {
                 logo.notationNotes[turtle] += ")} ";
                 i += 1;
-            } else if (nextObj === "markup") {
-                logo.notationNotes[turtle] +=
-                    "^\\markup { \\abs-fontsize #6 { " +
-                    // logo.notation.notationStaging[turtle][i + j + 1] +
-                    " } } } ";
-                j += 2;
-            } else if (nextObj === "markdown") {
+            } else if (nextObj === "markup") {} else if (nextObj === "markdown") {
                 logo.notationNotes[turtle] +=
                     "_\\markup {" 
killedBy: __processTuplet when i + j - 1 < 10 nextObj === "markup"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "\\meter
)} ^\\markup { \\abs-fontsize #6 {  } } } "
Received: undefined

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:186:24
             if (nextObj === ")") {
                 logo.notationNotes[turtle] += ")} ";
                 i += 1;
-            } else if (nextObj === "markup") {
+            } else if (true) {
                 logo.notationNotes[turtle] +=
                     "^\\markup { \\abs-fontsize #6 { " +
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+ \tuple 8/1 { ^\markup { \abs-fontsize #6 {  } } }

[Killed] StringLiteral
Harish/testing/src/lilypond.js:188:21
                 i += 1;
             } else if (nextObj === "markup") {
                 logo.notationNotes[turtle] +=
-                    "^\\markup { \\abs-fontsize #6 { " +
+                    "" +
                     // logo.notation.notationStaging[turtle][i + j + 1] +
                     " } } } ";
killedBy: __processTuplet when i + j - 1 < 10 nextObj === "markup"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- \meter
- )} ^\markup { \abs-fontsize #6 {  } } } 
+ undefined } } }

[Killed] BlockStatement
Harish/testing/src/lilypond.js:192:48
                     // logo.notation.notationStaging[turtle][i + j + 1] +
                     " } } } ";
                 j += 2;
-            } else if (nextObj === "markdown") {
-                logo.notationNotes[turtle] +=
-                    "_\\markup {" 
-                    // + logo.notation.notationStaging[turtle][i + j + 1] 
-                    + "} } ";
-                j += 2;
-            } else {
+            } else if (nextObj === "markdown") {} else {
                 logo.notationNotes[turtle] += "} ";
             }
killedBy: __processTuplet when i + j - 1 < 10 nextObj === "markdown"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "\\meter
)} ^\\markup { \\abs-fontsize #6 {  } } } _\\markup {} } "
Received: undefined

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:192:24
                     // logo.notation.notationStaging[turtle][i + j + 1] +
                     " } } } ";
                 j += 2;
-            } else if (nextObj === "markdown") {
+            } else if (true) {
                 logo.notationNotes[turtle] +=
                     "_\\markup {" 
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+ \tuple 8/1 { _\markup {} }

[Killed] BlockStatement
Harish/testing/src/lilypond.js:198:20
                     // + logo.notation.notationStaging[turtle][i + j + 1] 
                     + "} } ";
                 j += 2;
-            } else {
-                logo.notationNotes[turtle] += "} ";
-            }
+            } else {}
         } else {
             logo.notationNotes[turtle] += "} ";
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+ \tuple 8/1 { \tuple 8/1 { \tuple 8/1 {

[Killed] BlockStatement
Harish/testing/src/lilypond.js:201:16
             } else {
                 logo.notationNotes[turtle] += "} ";
             }
-        } else {
-            logo.notationNotes[turtle] += "} ";
-        }
+        } else {}
 
         return j;
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ undefined~~~~~_\markup {} } ~~~~~~~~

[Killed] BlockStatement
Harish/testing/src/lilypond.js:208:33
         return j;
     }
 
-    function findKeySignature() {
-        return "FLAT" + 
-                " " +
-                "SHARP";
-    }
+    function findKeySignature() {}
     function computeCounter(tupletNoteCounter, x) {
         if (x > 5) {
killedBy: findKeySignature should return the key signature
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FLAT SHARP"
Received: undefined

[Killed] BlockStatement
Harish/testing/src/lilypond.js:213:51
                 " " +
                 "SHARP";
     }
-    function computeCounter(tupletNoteCounter, x) {
-        if (x > 5) {
-            f = div(x, 5)
-            tupletNoteCounter *= f;
-            tupletNoteCounter += 1;
-            // break
-        } else if (x < 5) { // EQUIVALENT MUTANT GENERATED FOR THIS
-            f = div(5, x)
-            tupletNoteCounter += f;
-        } else {
-            tupletNoteCounter += 1;
-        }
-        return tupletNoteCounter
-    }
+    function computeCounter(tupletNoteCounter, x) {}
 
     function getScale() {
killedBy: computeCounter should calculate correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2.6
Received: undefined

[Killed] BlockStatement
Harish/testing/src/lilypond.js:214:20
                 "SHARP";
     }
     function computeCounter(tupletNoteCounter, x) {
-        if (x > 5) {
-            f = div(x, 5)
-            tupletNoteCounter *= f;
-            tupletNoteCounter += 1;
-            // break
-        } else if (x < 5) { // EQUIVALENT MUTANT GENERATED FOR THIS
+        if (x > 5) {} else if (x < 5) { // EQUIVALENT MUTANT GENERATED FOR THIS
             f = div(5, x)
             tupletNoteCounter += f;
killedBy: computeCounter should calculate correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2.6
Received: 1

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:214:13
                 "SHARP";
     }
     function computeCounter(tupletNoteCounter, x) {
-        if (x > 5) {
+        if (x <= 5) {
             f = div(x, 5)
             tupletNoteCounter *= f;
killedBy: computeCounter should calculate correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2.6
Received: 2
