[Killed] BlockStatement
Harish/testing/src/lilypond.js:219:27
             tupletNoteCounter *= f;
             tupletNoteCounter += 1;
             // break
-        } else if (x < 5) { // EQUIVALENT MUTANT GENERATED FOR THIS
-            f = div(5, x)
-            tupletNoteCounter += f;
-        } else {
+        } else if (x < 5) {} else {
             tupletNoteCounter += 1;
         }
killedBy: computeCounter should calculate correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2.666666666666667
Received: 1

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:219:20
             tupletNoteCounter *= f;
             tupletNoteCounter += 1;
             // break
-        } else if (x < 5) { // EQUIVALENT MUTANT GENERATED FOR THIS
+        } else if (false) { // EQUIVALENT MUTANT GENERATED FOR THIS
             f = div(5, x)
             tupletNoteCounter += f;
killedBy: computeCounter should calculate correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2.666666666666667
Received: 2

[Killed] BlockStatement
Harish/testing/src/lilypond.js:222:16
         } else if (x < 5) { // EQUIVALENT MUTANT GENERATED FOR THIS
             f = div(5, x)
             tupletNoteCounter += f;
-        } else {
-            tupletNoteCounter += 1;
-        }
+        } else {}
         return tupletNoteCounter
     }
killedBy: computeCounter should calculate correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] BlockStatement
Harish/testing/src/lilypond.js:228:25
         return tupletNoteCounter
     }
 
-    function getScale() {
-        return ["C", "D", "E", "F", "G", "A", "B"];
-    }
+    function getScale() {}
     function getExtendedScale() {
         scale = getScale()
killedBy: computeModeDef should correctly compute the modeDef
statusReason: TypeError: Cannot read property 'length' of undefined

[Killed] StringLiteral
Harish/testing/src/lilypond.js:229:42
     }
 
     function getScale() {
-        return ["C", "D", "E", "F", "G", "A", "B"];
+        return ["C", "D", "E", "F", "G", "", "B"];
     }
     function getExtendedScale() {
killedBy: findScale should return the scale
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -2,8 +2,8 @@
    "C",
    "D",

[Killed] StringLiteral
Harish/testing/src/lilypond.js:229:17
     }
 
     function getScale() {
-        return ["C", "D", "E", "F", "G", "A", "B"];
+        return ["", "D", "E", "F", "G", "A", "B"];
     }
     function getExtendedScale() {
killedBy: computeModeDef n > 6
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- major = #`((0 . ,SHARP) (1 . ,SHARP) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
+ major = #`((0 . ,NATURAL) (1 . ,SHARP) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )

[Killed] BlockStatement
Harish/testing/src/lilypond.js:231:33
     function getScale() {
         return ["C", "D", "E", "F", "G", "A", "B"];
     }
-    function getExtendedScale() {
-        scale = getScale()
-        l = scale.length;
-        for (var idx = 0; idx < l; idx++) {
-            scale.push(scale[idx] + "♭")
-            scale.push(scale[idx] + "♯")
-        }
-        return scale;
-    }
+    function getExtendedScale() {}
     function getEmptyString() {
         return "";
killedBy: computeModeDef should correctly compute the modeDef
statusReason: TypeError: Cannot read property 'indexOf' of undefined

[Killed] BlockStatement
Harish/testing/src/lilypond.js:234:43
     function getExtendedScale() {
         scale = getScale()
         l = scale.length;
-        for (var idx = 0; idx < l; idx++) {
-            scale.push(scale[idx] + "♭")
-            scale.push(scale[idx] + "♯")
-        }
+        for (var idx = 0; idx < l; idx++) {}
         return scale;
     }
killedBy: getExtendedScale should return the extended scale
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 14
+ Received  +  0

@@ -4,20 +4,6 @@
    "E",
    "F",

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:234:27
     function getExtendedScale() {
         scale = getScale()
         l = scale.length;
-        for (var idx = 0; idx < l; idx++) {
+        for (var idx = 0; false; idx++) {
             scale.push(scale[idx] + "♭")
             scale.push(scale[idx] + "♯")
killedBy: getExtendedScale should return the extended scale
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 14
+ Received  +  0

@@ -4,20 +4,6 @@
    "E",
    "F",

[Killed] BlockStatement
Harish/testing/src/lilypond.js:240:31
         }
         return scale;
     }
-    function getEmptyString() {
-        return "";
-    }
+    function getEmptyString() {}
     function getArr() {
         return [0,0];
killedBy: computeModeDef should correctly compute the modeDef when obj[0][0] is in scale
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- major = #`()
+ major = #`((0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )

[Killed] StringLiteral
Harish/testing/src/lilypond.js:241:16
         return scale;
     }
     function getEmptyString() {
-        return "";
+        return "Stryker was here!";
     }
     function getArr() {
killedBy: computeModeDef should correctly compute the modeDef when obj[0][0] is in scale
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- major = #`()
+ major = #`((0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )

[Killed] BlockStatement
Harish/testing/src/lilypond.js:243:23
     function getEmptyString() {
         return "";
     }
-    function getArr() {
-        return [0,0];
-    }
+    function getArr() {}
     function getSong() {
         return ["do", "re", "mi", "fa", "sol", "la", "ti"]
killedBy: getArr should return a default pair
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [0, 0]
Received: undefined

[Killed] BlockStatement
Harish/testing/src/lilypond.js:246:24
     function getArr() {
         return [0,0];
     }
-    function getSong() {
-        return ["do", "re", "mi", "fa", "sol", "la", "ti"]
-    }
+    function getSong() {}
     function getObj() {
         return [getScale(), getSong(), "C", "major"]
killedBy: findSong should return the song
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: ["do", "re", "mi", "fa", "sol", "la", "ti"]
Received: undefined

[Killed] StringLiteral
Harish/testing/src/lilypond.js:247:17
         return [0,0];
     }
     function getSong() {
-        return ["do", "re", "mi", "fa", "sol", "la", "ti"]
+        return ["", "re", "mi", "fa", "sol", "la", "ti"]
     }
     function getObj() {
killedBy: findSong should return the song
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Array [
-   "do",

[Killed] BlockStatement
Harish/testing/src/lilypond.js:249:23
     function getSong() {
         return ["do", "re", "mi", "fa", "sol", "la", "ti"]
     }
-    function getObj() {
-        return [getScale(), getSong(), "C", "major"]
-    }
+    function getObj() {}
     function getModeDef(mode) {
         return "\n" + mode.replace(/ /g, "_") + " = #`(";
killedBy: findObj should compute the obj
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [["C", "D", "E", "F", "G", "A", "B"], ["do", "re", "mi", "fa", "sol", "la", "ti"], "C", "major"]
Received: undefined

[Killed] ArrayDeclaration
Harish/testing/src/lilypond.js:250:16
         return ["do", "re", "mi", "fa", "sol", "la", "ti"]
     }
     function getObj() {
-        return [getScale(), getSong(), "C", "major"]
+        return []
     }
     function getModeDef(mode) {
killedBy: findObj should compute the obj
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 22
+ Received  +  1

- Array [
-   Array [
-     "C",

[Killed] StringLiteral
Harish/testing/src/lilypond.js:250:40
         return ["do", "re", "mi", "fa", "sol", "la", "ti"]
     }
     function getObj() {
-        return [getScale(), getSong(), "C", "major"]
+        return [getScale(), getSong(), "", "major"]
     }
     function getModeDef(mode) {
killedBy: findObj should compute the obj
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -15,8 +15,8 @@
      "fa",
      "sol",

[Killed] BlockStatement
Harish/testing/src/lilypond.js:252:31
     function getObj() {
         return [getScale(), getSong(), "C", "major"]
     }
-    function getModeDef(mode) {
-        return "\n" + mode.replace(/ /g, "_") + " = #`(";
-    }
+    function getModeDef(mode) {}
     function processLilypondNotes(lilypond, logo, turtle, obj, flag, mode, arr=getArr(), word=getEmptyString(), isComplete=true) {
         // obj = [instructions] or
killedBy: computeModeDef should correctly compute the modeDef
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

-
- major = #`((0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )
+ undefined(0 . ,NATURAL) (1 . ,NATURAL) (2 . ,NATURAL) (3 . ,NATURAL) (4 . ,NATURAL) (5 . ,NATURAL) (6 . ,NATURAL) )

[Killed] BooleanLiteral
Harish/testing/src/lilypond.js:255:124
     function getModeDef(mode) {
         return "\n" + mode.replace(/ /g, "_") + " = #`(";
     }
-    function processLilypondNotes(lilypond, logo, turtle, obj, flag, mode, arr=getArr(), word=getEmptyString(), isComplete=true) {
+    function processLilypondNotes(lilypond, logo, turtle, obj, flag, mode, arr=getArr(), word=getEmptyString(), isComplete=false) {
         // obj = [instructions] or
         // obj = [note, duration, dotCount, tupletValue, roundDown, insideChord, staccato]
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: TypeError: Cannot read property '0' of undefined

[Killed] StringLiteral
Harish/testing/src/lilypond.js:259:38
         // obj = [instructions] or
         // obj = [note, duration, dotCount, tupletValue, roundDown, insideChord, staccato]
 
-        logo.notationNotes[turtle] = "\\meter\n";
+        logo.notationNotes[turtle] = "";
 
         let queueSlur = false;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "\\meter
"
Received: ""

[Killed] BooleanLiteral
Harish/testing/src/lilypond.js:261:25
 
         logo.notationNotes[turtle] = "\\meter\n";
 
-        let queueSlur = false;
+        let queueSlur = true;
         let articulation = false;
         let targetDuration = 0;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
  \tempo swing
- \tempo swing

[Killed] BooleanLiteral
Harish/testing/src/lilypond.js:262:28
         logo.notationNotes[turtle] = "\\meter\n";
 
         let queueSlur = false;
-        let articulation = false;
+        let articulation = true;
         let targetDuration = 0;
         let tupletDuration = 0;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 3

  \meter
  \tempo swing
- \tempo swing

[Killed] BooleanLiteral
Harish/testing/src/lilypond.js:265:26
         let articulation = false;
         let targetDuration = 0;
         let tupletDuration = 0;
-        let multivoice = false;
+        let multivoice = true;
         let keySignature;
         let key;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 2

  \meter
- << { \voiceOne }
+ }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:273:13
         let note;
         let notes;
         // print(logo.notation)
-        if (flag) {
+        if (false) {
             for (let i = 0; i < 3; i++) {
                 // let obj = logo.notation.notationStaging[turtle][i];
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 4
+ Received  + 1

- \meter
- \tempo swing
- \tempo swing

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:273:13
         let note;
         let notes;
         // print(logo.notation)
-        if (flag) {
+        if (true) {
             for (let i = 0; i < 3; i++) {
                 // let obj = logo.notation.notationStaging[turtle][i];
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 4

- \meter
+ \meter
+ \tempo swing

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:274:29
         let notes;
         // print(logo.notation)
         if (flag) {
-            for (let i = 0; i < 3; i++) {
+            for (let i = 0; i <= 3; i++) {
                 // let obj = logo.notation.notationStaging[turtle][i];
                 if (typeof obj === "string") {
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 2

  \meter
  \tempo swing
  \tempo swing

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:274:29
         let notes;
         // print(logo.notation)
         if (flag) {
-            for (let i = 0; i < 3; i++) {
+            for (let i = 0; false; i++) {
                 // let obj = logo.notation.notationStaging[turtle][i];
                 if (typeof obj === "string") {
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 4
+ Received  + 1

- \meter
- \tempo swing
- \tempo swing

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:276:21
         if (flag) {
             for (let i = 0; i < 3; i++) {
                 // let obj = logo.notation.notationStaging[turtle][i];
-                if (typeof obj === "string") {
+                if (typeof obj !== "string") {
                     switch (obj) {
                         case "swing":
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 4
+ Received  + 1

  \meter
- \tempo swing
- \tempo swing

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:276:21
         if (flag) {
             for (let i = 0; i < 3; i++) {
                 // let obj = logo.notation.notationStaging[turtle][i];
-                if (typeof obj === "string") {
+                if (false) {
                     switch (obj) {
                         case "swing":
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 4
+ Received  + 1

  \meter
- \tempo swing
- \tempo swing

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:278:25
                 // let obj = logo.notation.notationStaging[turtle][i];
                 if (typeof obj === "string") {
                     switch (obj) {
-                        case "swing":
-                            logo.notationNotes[turtle] += "\\tempo swing\n";
-                            break;
+                        case "swing":
                         case "tempo":
                             logo.notationNotes[turtle] +=
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
- \tempo swing
- \tempo swing

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:281:25
                         case "swing":
                             logo.notationNotes[turtle] += "\\tempo swing\n";
                             break;
-                        case "tempo":
-                            logo.notationNotes[turtle] +=
-                                "\\tempo " +
-                                "3" +
-                                // logo.notation.notationStaging[turtle][i + 2] +
-                                " = " +
-                                "6" +
-                                // logo.notation.notationStaging[turtle][i + 1] +
-                                "\n";
-                            i += 2;
-                            break;
+                        case "tempo":
                         case "markup":
                             logo.notationNotes[turtle] +=
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

  \meter
- \tempo 3 = 6
-

[Killed] StringLiteral
Harish/testing/src/lilypond.js:281:30
                         case "swing":
                             logo.notationNotes[turtle] += "\\tempo swing\n";
                             break;
-                        case "tempo":
+                        case "":
                             logo.notationNotes[turtle] +=
                                 "\\tempo " +
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

  \meter
- \tempo 3 = 6
-

[Killed] StringLiteral
Harish/testing/src/lilypond.js:284:33
                         case "tempo":
                             logo.notationNotes[turtle] +=
                                 "\\tempo " +
-                                "3" +
+                                "" +
                                 // logo.notation.notationStaging[turtle][i + 2] +
                                 " = " +
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tempo 3 = 6
+ \tempo  = 6

[Killed] StringLiteral
Harish/testing/src/lilypond.js:286:33
                                 "\\tempo " +
                                 "3" +
                                 // logo.notation.notationStaging[turtle][i + 2] +
-                                " = " +
+                                "" +
                                 "6" +
                                 // logo.notation.notationStaging[turtle][i + 1] +
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tempo 3 = 6
+ \tempo 36

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:292:25
                                 "\n";
                             i += 2;
                             break;
-                        case "markup":
-                            logo.notationNotes[turtle] +=
-                                "^\\markup { \\abs-fontsize #6 { " +
-                                "6" +
-                                // logo.notation.notationStaging[turtle][i + 1] +
-                                " } } ";
-                            i += 1;
-                            break;
+                        case "markup":
                         case "markdown":
                             logo.notationNotes[turtle] +=
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- ^\markup { \abs-fontsize #6 { 6 } } ^\markup { \abs-fontsize #6 { 6 } } 
+ _\markup { 6 } _\markup { 6 }

[Killed] StringLiteral
Harish/testing/src/lilypond.js:292:30
                                 "\n";
                             i += 2;
                             break;
-                        case "markup":
+                        case "":
                             logo.notationNotes[turtle] +=
                                 "^\\markup { \\abs-fontsize #6 { " +
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- ^\markup { \abs-fontsize #6 { 6 } } ^\markup { \abs-fontsize #6 { 6 } } 
+ markupmarkupmarkup

[Killed] StringLiteral
Harish/testing/src/lilypond.js:297:33
                                 "^\\markup { \\abs-fontsize #6 { " +
                                 "6" +
                                 // logo.notation.notationStaging[turtle][i + 1] +
-                                " } } ";
+                                "";
                             i += 1;
                             break;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- ^\markup { \abs-fontsize #6 { 6 } } ^\markup { \abs-fontsize #6 { 6 } } 
+ ^\markup { \abs-fontsize #6 { 6^\markup { \abs-fontsize #6 { 6

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:300:25
                                 " } } ";
                             i += 1;
                             break;
-                        case "markdown":
-                            logo.notationNotes[turtle] +=
-                                "_\\markup { " + "6"
-                                // logo.notation.notationStaging[turtle][i + 1] 
-                                + " } ";
-                            i += 1;
-                            break;
+                        case "markdown":
                         case "break":
                             if (i > 0) {
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 3

  \meter
- _\markup { 6 } _\markup { 6 } 
+

[Killed] StringLiteral
Harish/testing/src/lilypond.js:304:35
                             logo.notationNotes[turtle] +=
                                 "_\\markup { " + "6"
                                 // logo.notation.notationStaging[turtle][i + 1] 
-                                + " } ";
+                                + "";
                             i += 1;
                             break;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- _\markup { 6 } _\markup { 6 } 
+ _\markup { 6_\markup { 6

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:307:25
                                 + " } ";
                             i += 1;
                             break;
-                        case "break":
-                            if (i > 0) {
-                                logo.notationNotes[turtle] += "\n";
-                            }
-                            break;
+                        case "break":
                         case "begin articulation":
                             articulation = true;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
-
-

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:308:33
                             i += 1;
                             break;
                         case "break":
-                            if (i > 0) {
+                            if (true) {
                                 logo.notationNotes[turtle] += "\n";
                             }
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 0
+ Received  + 1

  \meter

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:308:33
                             i += 1;
                             break;
                         case "break":
-                            if (i > 0) {
+                            if (i <= 0) {
                                 logo.notationNotes[turtle] += "\n";
                             }
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 0

  \meter

[Killed] StringLiteral
Harish/testing/src/lilypond.js:309:63
                             break;
                         case "break":
                             if (i > 0) {
-                                logo.notationNotes[turtle] += "\n";
+                                logo.notationNotes[turtle] += "";
                             }
                             break;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 0

  \meter

-

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:312:25
                                 logo.notationNotes[turtle] += "\n";
                             }
                             break;
-                        case "begin articulation":
-                            articulation = true;
-                            break;
+                        case "begin articulation":
                         case "end articulation":
                             articulation = false;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- ->->->
+

[Killed] BooleanLiteral
Harish/testing/src/lilypond.js:313:44
                             }
                             break;
                         case "begin articulation":
-                            articulation = true;
+                            articulation = false;
                             break;
                         case "end articulation":
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- ->->->
+

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:315:25
                         case "begin articulation":
                             articulation = true;
                             break;
-                        case "end articulation":
-                            articulation = false;
-                            break;
+                        case "end articulation":
                         case "begin crescendo":
                             logo.notationNotes[turtle] += "\\< ";
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
-
+ \< \< \<

[Killed] BooleanLiteral
Harish/testing/src/lilypond.js:316:44
                             articulation = true;
                             break;
                         case "end articulation":
-                            articulation = false;
+                            articulation = true;
                             break;
                         case "begin crescendo":
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
-
+ ->->->

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:318:25
                         case "end articulation":
                             articulation = false;
                             break;
-                        case "begin crescendo":
-                            logo.notationNotes[turtle] += "\\< ";
-                            break;
+                        case "begin crescendo":
                         case "begin decrescendo":
                             logo.notationNotes[turtle] += "\\> ";
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \< \< \< 
+ \> \> \>
