[Killed] StringLiteral
Harish/testing/src/lilypond.js:318:30
                         case "end articulation":
                             articulation = false;
                             break;
-                        case "begin crescendo":
+                        case "":
                             logo.notationNotes[turtle] += "\\< ";
                             break;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \< \< \< 
+ begin crescendobegin crescendobegin crescendo

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:321:25
                         case "begin crescendo":
                             logo.notationNotes[turtle] += "\\< ";
                             break;
-                        case "begin decrescendo":
-                            logo.notationNotes[turtle] += "\\> ";
-                            break;
+                        case "begin decrescendo":
                         case "end crescendo":
                             logo.notationNotes[turtle] += "\\? ";
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \> \> \> 
+ \? \? \?

[Killed] StringLiteral
Harish/testing/src/lilypond.js:321:30
                         case "begin crescendo":
                             logo.notationNotes[turtle] += "\\< ";
                             break;
-                        case "begin decrescendo":
+                        case "":
                             logo.notationNotes[turtle] += "\\> ";
                             break;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \> \> \> 
+ begin decrescendobegin decrescendobegin decrescendo

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:324:25
                         case "begin decrescendo":
                             logo.notationNotes[turtle] += "\\> ";
                             break;
-                        case "end crescendo":
-                            logo.notationNotes[turtle] += "\\? ";
-                            break;
+                        case "end crescendo":
                         case "end decrescendo":
                             logo.notationNotes[turtle] += "\\! ";
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \? \? \? 
+ \! \! \!

[Killed] StringLiteral
Harish/testing/src/lilypond.js:324:30
                         case "begin decrescendo":
                             logo.notationNotes[turtle] += "\\> ";
                             break;
-                        case "end crescendo":
+                        case "":
                             logo.notationNotes[turtle] += "\\? ";
                             break;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \? \? \? 
+ end crescendoend crescendoend crescendo

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:327:25
                         case "end crescendo":
                             logo.notationNotes[turtle] += "\\? ";
                             break;
-                        case "end decrescendo":
-                            logo.notationNotes[turtle] += "\\! ";
-                            break;
+                        case "end decrescendo":
                         case "begin slur":
                             // The ( is added after the first note.
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \! \! \! 
+ (  (  (

[Killed] StringLiteral
Harish/testing/src/lilypond.js:328:59
                             logo.notationNotes[turtle] += "\\? ";
                             break;
                         case "end decrescendo":
-                            logo.notationNotes[turtle] += "\\! ";
+                            logo.notationNotes[turtle] += "";
                             break;
                         case "begin slur":
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \! \! \! 
+

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:330:25
                         case "end decrescendo":
                             logo.notationNotes[turtle] += "\\! ";
                             break;
-                        case "begin slur":
-                            // The ( is added after the first note.
-                            queueSlur = true;
-                            break;
+                        case "begin slur":
                         case "end slur":
                             logo.notationNotes[turtle] += ")  ";
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- (  (  (  
+ )  )  )

[Killed] BooleanLiteral
Harish/testing/src/lilypond.js:332:41
                             break;
                         case "begin slur":
                             // The ( is added after the first note.
-                            queueSlur = true;
+                            queueSlur = false;
                             break;
                         case "end slur":
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- (  (  (  
+

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:334:25
                             // The ( is added after the first note.
                             queueSlur = true;
                             break;
-                        case "end slur":
-                            logo.notationNotes[turtle] += ")  ";
-                            break;
+                        case "end slur":
                         case "begin harmonics":
                             logo.notationNotes[turtle] += "\\harmonicsOn ";
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- )  )  )  
+ \harmonicsOn \harmonicsOn \harmonicsOn

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:337:25
                         case "end slur":
                             logo.notationNotes[turtle] += ")  ";
                             break;
-                        case "begin harmonics":
-                            logo.notationNotes[turtle] += "\\harmonicsOn ";
-                            break;
+                        case "begin harmonics":
                         case "end harmonics":
                             logo.notationNotes[turtle] += "\\harmonicsOff ";
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \harmonicsOn \harmonicsOn \harmonicsOn 
+ \harmonicsOff \harmonicsOff \harmonicsOff

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:340:25
                         case "begin harmonics":
                             logo.notationNotes[turtle] += "\\harmonicsOn ";
                             break;
-                        case "end harmonics":
-                            logo.notationNotes[turtle] += "\\harmonicsOff ";
-                            break;
+                        case "end harmonics":
                         case "tie":
                             logo.notationNotes[turtle] += "~";
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \harmonicsOff \harmonicsOff \harmonicsOff 
+ ~~~

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:343:25
                         case "end harmonics":
                             logo.notationNotes[turtle] += "\\harmonicsOff ";
                             break;
-                        case "tie":
-                            logo.notationNotes[turtle] += "~";
-                            break;
+                        case "tie":
                         case "key":
                             keySignature = findKeySignature();
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 2

  \meter
- ~~~
+ \key esisisiseses \major

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:346:25
                         case "tie":
                             logo.notationNotes[turtle] += "~";
                             break;
-                        case "key":
-                            keySignature = findKeySignature();
-                            key = "♭𝄪♯♮𝄫"
-                                .toLowerCase()
-                                .replace("♭", "es") // check macro FLAT
-                                .replace("♯", "is")
-                                .replace("♮", "")
-                                .replace("𝄪", "isis")
-                                .replace("𝄫", "eses");
-                            // mode = logo.notation.notationStaging[turtle][i + 2];
-                            // Lilypond knows about common modes.
-                            if (["major", "minor", "ionian", "dorian", "phrygian","lydian", "mixolydian","aeolian", "locrian"].indexOf(mode) !== -1)
-                            {
-                                logo.notationNotes[turtle] += "\\key " + key + " \\" + mode + "\n";
-                            } 
-                            else {
-                                obj = getObj(); 
-                                let modeDef = computeModeDef(mode, obj, lilypond, logo, turtle, key)
-                            }
-                            i += 2;
-                            break;
+                        case "key":
                         case "meter":
                             logo.notationNotes[turtle] +=
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \key esisisiseses \major
+  \time 3/4

[Killed] StringLiteral
Harish/testing/src/lilypond.js:350:47
                             keySignature = findKeySignature();
                             key = "♭𝄪♯♮𝄫"
                                 .toLowerCase()
-                                .replace("♭", "es") // check macro FLAT
+                                .replace("♭", "") // check macro FLAT
                                 .replace("♯", "is")
                                 .replace("♮", "")
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \key esisisiseses \major
+ \key isisiseses \major

[Killed] StringLiteral
Harish/testing/src/lilypond.js:351:47
                             key = "♭𝄪♯♮𝄫"
                                 .toLowerCase()
                                 .replace("♭", "es") // check macro FLAT
-                                .replace("♯", "is")
+                                .replace("♯", "")
                                 .replace("♮", "")
                                 .replace("𝄪", "isis")
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \key esisisiseses \major
+ \key esisiseses \major

[Killed] StringLiteral
Harish/testing/src/lilypond.js:352:47
                                 .toLowerCase()
                                 .replace("♭", "es") // check macro FLAT
                                 .replace("♯", "is")
-                                .replace("♮", "")
+                                .replace("♮", "Stryker was here!")
                                 .replace("𝄪", "isis")
                                 .replace("𝄫", "eses");
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \key esisisiseses \major
+ \key esisisisStryker was here!eses \major

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:357:33
                                 .replace("𝄫", "eses");
                             // mode = logo.notation.notationStaging[turtle][i + 2];
                             // Lilypond knows about common modes.
-                            if (["major", "minor", "ionian", "dorian", "phrygian","lydian", "mixolydian","aeolian", "locrian"].indexOf(mode) !== -1)
+                            if (["major", "minor", "ionian", "dorian", "phrygian", "lydian", "mixolydian", "aeolian", "locrian"].indexOf(mode) === -1)
                             {
                                 logo.notationNotes[turtle] += "\\key " + key + " \\" + mode + "\n";
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \key esisisiseses \major
+  \key esisisiseses \major

[Killed] UnaryOperator
Harish/testing/src/lilypond.js:357:146
                                 .replace("𝄫", "eses");
                             // mode = logo.notation.notationStaging[turtle][i + 2];
                             // Lilypond knows about common modes.
-                            if (["major", "minor", "ionian", "dorian", "phrygian","lydian", "mixolydian","aeolian", "locrian"].indexOf(mode) !== -1)
+                            if (["major", "minor", "ionian", "dorian", "phrygian","lydian", "mixolydian","aeolian", "locrian"].indexOf(mode) !== +1)
                             {
                                 logo.notationNotes[turtle] += "\\key " + key + " \\" + mode + "\n";
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \key esisisiseses \minor
+  \key esisisiseses \minor

[Killed] BlockStatement
Harish/testing/src/lilypond.js:358:29
                             // mode = logo.notation.notationStaging[turtle][i + 2];
                             // Lilypond knows about common modes.
                             if (["major", "minor", "ionian", "dorian", "phrygian","lydian", "mixolydian","aeolian", "locrian"].indexOf(mode) !== -1)
-                            {
-                                logo.notationNotes[turtle] += "\\key " + key + " \\" + mode + "\n";
-                            } 
+                            {} 
                             else {
                                 obj = getObj(); 
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- \meter
- \key esisisiseses \major
+ \meter

[Killed] StringLiteral
Harish/testing/src/lilypond.js:359:63
                             // Lilypond knows about common modes.
                             if (["major", "minor", "ionian", "dorian", "phrygian","lydian", "mixolydian","aeolian", "locrian"].indexOf(mode) !== -1)
                             {
-                                logo.notationNotes[turtle] += "\\key " + key + " \\" + mode + "\n";
+                                logo.notationNotes[turtle] += "" + key + " \\" + mode + "\n";
                             } 
                             else {
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \key esisisiseses \major
+ esisisiseses \major

[Killed] BlockStatement
Harish/testing/src/lilypond.js:361:34
                             {
                                 logo.notationNotes[turtle] += "\\key " + key + " \\" + mode + "\n";
                             } 
-                            else {
-                                obj = getObj(); 
-                                let modeDef = computeModeDef(mode, obj, lilypond, logo, turtle, key)
-                            }
+                            else {}
                             i += 2;
                             break;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- \meter
-  \key esisisiseses \
+ \meter

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:367:25
                             }
                             i += 2;
                             break;
-                        case "meter":
-                            logo.notationNotes[turtle] +=
-                                " \\time " +
-                                "3" + 
-                                // logo.notation.notationStaging[turtle][i + 1] +
-                                "/" + "4" +
-                                // logo.notation.notationStaging[turtle][i + 2] +
-                                "\n";
-                            i += 2;
-                            break;
+                        case "meter":
                         case "pickup":
                             logo.notationNotes[turtle] +=
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 2

  \meter
-  \time 3/4
+  \partial 3

[Killed] StringLiteral
Harish/testing/src/lilypond.js:372:39
                                 " \\time " +
                                 "3" + 
                                 // logo.notation.notationStaging[turtle][i + 1] +
-                                "/" + "4" +
+                                "/" + "" +
                                 // logo.notation.notationStaging[turtle][i + 2] +
                                 "\n";
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
-  \time 3/4
+  \time 3/

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:377:25
                                 "\n";
                             i += 2;
                             break;
-                        case "pickup":
-                            logo.notationNotes[turtle] +=
-                                " \\partial " + "3" + "\n";
-                            i += 1;
-                            break;
+                        case "pickup":
                         case "voice one":
                             if (multivoice) {
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 3

  \meter
-  \partial 3
-  \partial 3

[Killed] StringLiteral
Harish/testing/src/lilypond.js:377:30
                                 "\n";
                             i += 2;
                             break;
-                        case "pickup":
+                        case "":
                             logo.notationNotes[turtle] +=
                                 " \\partial " + "3" + "\n";
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
-  \partial 3
-  \partial 3

[Killed] StringLiteral
Harish/testing/src/lilypond.js:379:33
                             break;
                         case "pickup":
                             logo.notationNotes[turtle] +=
-                                " \\partial " + "3" + "\n";
+                                "" + "3" + "\n";
                             i += 1;
                             break;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 2

  \meter
-  \partial 3
-  \partial 3

[Killed] StringLiteral
Harish/testing/src/lilypond.js:379:55
                             break;
                         case "pickup":
                             logo.notationNotes[turtle] +=
-                                " \\partial " + "3" + "\n";
+                                " \\partial " + "3" + "";
                             i += 1;
                             break;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
-  \partial 3
-  \partial 3

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:382:25
                                 " \\partial " + "3" + "\n";
                             i += 1;
                             break;
-                        case "voice one":
-                            if (multivoice) {
-                                logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceOne ";
-                            } else {
-                                logo.notationNotes[turtle] += "<< { \\voiceOne ";
-                                multivoice = true;
-                            }
-                            break;
+                        case "voice one":
                         case "voice two":
                             if (multivoice) {
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 3

  \meter
- << { \voiceOne }
+ << { \voiceTwo }

[Killed] StringLiteral
Harish/testing/src/lilypond.js:382:30
                                 " \\partial " + "3" + "\n";
                             i += 1;
                             break;
-                        case "voice one":
+                        case "":
                             if (multivoice) {
                                 logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceOne ";
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
- << { \voiceOne }
- \new Voice { \voiceOne }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:383:33
                             i += 1;
                             break;
                         case "voice one":
-                            if (multivoice) {
+                            if (false) {
                                 logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceOne ";
                             } else {
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
- << { \voiceOne }
- \new Voice { \voiceOne }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:383:33
                             i += 1;
                             break;
                         case "voice one":
-                            if (multivoice) {
+                            if (true) {
                                 logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceOne ";
                             } else {
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 2

  \meter
- << { \voiceOne }
+ }

[Killed] BlockStatement
Harish/testing/src/lilypond.js:385:36
                         case "voice one":
                             if (multivoice) {
                                 logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceOne ";
-                            } else {
-                                logo.notationNotes[turtle] += "<< { \\voiceOne ";
-                                multivoice = true;
-                            }
+                            } else {}
                             break;
                         case "voice two":
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
- << { \voiceOne }
- \new Voice { \voiceOne }

[Killed] BooleanLiteral
Harish/testing/src/lilypond.js:387:46
                                 logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceOne ";
                             } else {
                                 logo.notationNotes[turtle] += "<< { \\voiceOne ";
-                                multivoice = true;
+                                multivoice = false;
                             }
                             break;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
- << { \voiceOne }
- \new Voice { \voiceOne }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:390:25
                                 multivoice = true;
                             }
                             break;
-                        case "voice two":
-                            if (multivoice) {
-                                logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceTwo ";
-                            } else {
-                                logo.notationNotes[turtle] += "<< { \\voiceTwo ";
-                                multivoice = true;
-                            }
-                            break;
+                        case "voice two":
                         case "voice three":
                             if (multivoice) {
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 3

  \meter
- << { \voiceTwo }
+ << { \voiceThree }

[Killed] BlockStatement
Harish/testing/src/lilypond.js:391:45
                             }
                             break;
                         case "voice two":
-                            if (multivoice) {
-                                logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceTwo ";
-                            } else {
+                            if (multivoice) {} else {
                                 logo.notationNotes[turtle] += "<< { \\voiceTwo ";
                                 multivoice = true;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
- << { \voiceTwo }
- \new Voice { \voiceTwo }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:391:33
                             }
                             break;
                         case "voice two":
-                            if (multivoice) {
+                            if (false) {
                                 logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceTwo ";
                             } else {
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
- << { \voiceTwo }
- \new Voice { \voiceTwo }

[Killed] StringLiteral
Harish/testing/src/lilypond.js:392:63
                             break;
                         case "voice two":
                             if (multivoice) {
-                                logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceTwo ";
+                                logo.notationNotes[turtle] += "";
                             } else {
                                 logo.notationNotes[turtle] += "<< { \\voiceTwo ";
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
- << { \voiceTwo }
- \new Voice { \voiceTwo }
