[Killed] BlockStatement
Harish/testing/src/lilypond.js:393:36
                         case "voice two":
                             if (multivoice) {
                                 logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceTwo ";
-                            } else {
-                                logo.notationNotes[turtle] += "<< { \\voiceTwo ";
-                                multivoice = true;
-                            }
+                            } else {}
                             break;
                         case "voice three":
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
- << { \voiceTwo }
- \new Voice { \voiceTwo }

[Killed] BooleanLiteral
Harish/testing/src/lilypond.js:395:46
                                 logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceTwo ";
                             } else {
                                 logo.notationNotes[turtle] += "<< { \\voiceTwo ";
-                                multivoice = true;
+                                multivoice = false;
                             }
                             break;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
- << { \voiceTwo }
- \new Voice { \voiceTwo }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:398:25
                                 multivoice = true;
                             }
                             break;
-                        case "voice three":
-                            if (multivoice) {
-                                logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceThree ";
-                            } else {
-                                logo.notationNotes[turtle] += "<< { \\voiceThree ";
-                                multivoice = true;
-                            }
-                            break;
+                        case "voice three":
                         case "voice four":
                             if (multivoice) {
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 3

  \meter
- << { \voiceThree }
+ << { \voiceFour }

[Killed] BlockStatement
Harish/testing/src/lilypond.js:399:45
                             }
                             break;
                         case "voice three":
-                            if (multivoice) {
-                                logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceThree ";
-                            } else {
+                            if (multivoice) {} else {
                                 logo.notationNotes[turtle] += "<< { \\voiceThree ";
                                 multivoice = true;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
- << { \voiceThree }
- \new Voice { \voiceThree }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:399:33
                             }
                             break;
                         case "voice three":
-                            if (multivoice) {
+                            if (true) {
                                 logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceThree ";
                             } else {
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 2

  \meter
- << { \voiceThree }
+ }

[Killed] StringLiteral
Harish/testing/src/lilypond.js:400:63
                             break;
                         case "voice three":
                             if (multivoice) {
-                                logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceThree ";
+                                logo.notationNotes[turtle] += "";
                             } else {
                                 logo.notationNotes[turtle] += "<< { \\voiceThree ";
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
- << { \voiceThree }
- \new Voice { \voiceThree }

[Killed] BlockStatement
Harish/testing/src/lilypond.js:401:36
                         case "voice three":
                             if (multivoice) {
                                 logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceThree ";
-                            } else {
-                                logo.notationNotes[turtle] += "<< { \\voiceThree ";
-                                multivoice = true;
-                            }
+                            } else {}
                             break;
                         case "voice four":
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
- << { \voiceThree }
- \new Voice { \voiceThree }

[Killed] BooleanLiteral
Harish/testing/src/lilypond.js:403:46
                                 logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceThree ";
                             } else {
                                 logo.notationNotes[turtle] += "<< { \\voiceThree ";
-                                multivoice = true;
+                                multivoice = false;
                             }
                             break;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
- << { \voiceThree }
- \new Voice { \voiceThree }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:406:25
                                 multivoice = true;
                             }
                             break;
-                        case "voice four":
-                            if (multivoice) {
-                                logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceFour ";
-                            } else {
-                                logo.notationNotes[turtle] += "<< { \\voiceFour ";
-                                multivoice = true;
-                            }
-                            break;
+                        case "voice four":
                         case "one voice":
                             logo.notationNotes[turtle] += "}\n>> \\oneVoice\n";
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 7

  \meter
- << { \voiceFour }
- \new Voice { \voiceFour }

[Killed] BlockStatement
Harish/testing/src/lilypond.js:407:45
                             }
                             break;
                         case "voice four":
-                            if (multivoice) {
-                                logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceFour ";
-                            } else {
+                            if (multivoice) {} else {
                                 logo.notationNotes[turtle] += "<< { \\voiceFour ";
                                 multivoice = true;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
- << { \voiceFour }
- \new Voice { \voiceFour }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:407:33
                             }
                             break;
                         case "voice four":
-                            if (multivoice) {
+                            if (false) {
                                 logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceFour ";
                             } else {
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
- << { \voiceFour }
- \new Voice { \voiceFour }

[Killed] StringLiteral
Harish/testing/src/lilypond.js:408:63
                             break;
                         case "voice four":
                             if (multivoice) {
-                                logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceFour ";
+                                logo.notationNotes[turtle] += "";
                             } else {
                                 logo.notationNotes[turtle] += "<< { \\voiceFour ";
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
- << { \voiceFour }
- \new Voice { \voiceFour }

[Killed] BlockStatement
Harish/testing/src/lilypond.js:409:36
                         case "voice four":
                             if (multivoice) {
                                 logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceFour ";
-                            } else {
-                                logo.notationNotes[turtle] += "<< { \\voiceFour ";
-                                multivoice = true;
-                            }
+                            } else {}
                             break;
                         case "one voice":
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
- << { \voiceFour }
- \new Voice { \voiceFour }

[Killed] BooleanLiteral
Harish/testing/src/lilypond.js:411:46
                                 logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceFour ";
                             } else {
                                 logo.notationNotes[turtle] += "<< { \\voiceFour ";
-                                multivoice = true;
+                                multivoice = false;
                             }
                             break;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
- << { \voiceFour }
- \new Voice { \voiceFour }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:414:25
                                 multivoice = true;
                             }
                             break;
-                        case "one voice":
-                            logo.notationNotes[turtle] += "}\n>> \\oneVoice\n";
-                            break;
+                        case "one voice":
                         default:
                             logo.notationNotes[turtle] += obj;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 7
+ Received  + 1

  \meter
- }
- >> \oneVoice

[Killed] StringLiteral
Harish/testing/src/lilypond.js:415:59
                             }
                             break;
                         case "one voice":
-                            logo.notationNotes[turtle] += "}\n>> \\oneVoice\n";
+                            logo.notationNotes[turtle] += "";
                             break;
                         default:
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 7
+ Received  + 1

- \meter
- }
- >> \oneVoice

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:417:25
                         case "one voice":
                             logo.notationNotes[turtle] += "}\n>> \\oneVoice\n";
                             break;
-                        default:
-                            logo.notationNotes[turtle] += obj;
-                            break;
+                        default:
                     }
                 } 
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- hihihi
+

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:422:26
                             break;
                     }
                 } 
-                else if (typeof obj === "number") {
+                else if (false) {
                     // logo.notationNotes[turtle] = "gayugayu"
                     throw new Error("Obj should be a string or an array");
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Obj should be a string or an array"
Received message:   "Cannot read property 'replace' of undefined"

      309 |     }
      310 |

[Killed] BlockStatement
Harish/testing/src/lilypond.js:422:51
                             break;
                     }
                 } 
-                else if (typeof obj === "number") {
-                    // logo.notationNotes[turtle] = "gayugayu"
-                    throw new Error("Obj should be a string or an array");
-                }
+                else if (typeof obj === "number") {}
                 else {
                     notes = obj[0];
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Obj should be a string or an array"

Received function did not throw

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:439:25
 
                     // If it is a tuplet, look ahead to see if it is complete.
                     // While you are at it, add up the durations.
-                    if (arr[0] != null) {
+                    if (arr[0] == null) {
                         let f;
                         targetDuration = 1 / 2.0;
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+ \tuplet 0/1 { }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:439:25
 
                     // If it is a tuplet, look ahead to see if it is complete.
                     // While you are at it, add up the durations.
-                    if (arr[0] != null) {
+                    if (false) {
                         let f;
                         targetDuration = 1 / 2.0;
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+ \tuplet 0/1 { }

[Killed] ArithmeticOperator
Harish/testing/src/lilypond.js:441:42
                     // While you are at it, add up the durations.
                     if (arr[0] != null) {
                         let f;
-                        targetDuration = 1 / 2.0;
+                        targetDuration = 1 * 2.0;
                         tupletDuration = 1 / 2.0;
                         totalTupletDuration = (isComplete) ? 1 / (2 * 4)
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] = 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuplet 1/2 { } \tuplet 1/2 { } \tuplet 1/2 { } 
+ \tuplet 2/4 { } \tuplet 2/4 { } \tuplet 2/4 { }

[Killed] ArithmeticOperator
Harish/testing/src/lilypond.js:442:42
                     if (arr[0] != null) {
                         let f;
                         targetDuration = 1 / 2.0;
-                        tupletDuration = 1 / 2.0;
+                        tupletDuration = 1 * 2.0;
                         totalTupletDuration = (isComplete) ? 1 / (2 * 4)
                             : -1;
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] = 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuplet 1/2 { } \tuplet 1/2 { } \tuplet 1/2 { } 
+ \tuplet 2/4 { } \tuplet 2/4 { } \tuplet 2/4 { }

[Killed] ArithmeticOperator
Harish/testing/src/lilypond.js:443:67
                         let f;
                         targetDuration = 1 / 2.0;
                         tupletDuration = 1 / 2.0;
-                        totalTupletDuration = (isComplete) ? 1 / (2 * 4)
+                        totalTupletDuration = (isComplete) ? 1 / (2 / 4)
                             : -1;
 
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: TypeError: Cannot read property '0' of undefined

[Killed] ArithmeticOperator
Harish/testing/src/lilypond.js:443:62
                         let f;
                         targetDuration = 1 / 2.0;
                         tupletDuration = 1 / 2.0;
-                        totalTupletDuration = (isComplete) ? 1 / (2 * 4)
+                        totalTupletDuration = (isComplete) ? 1 * (2 * 4)
                             : -1;
 
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: TypeError: Cannot read property '0' of undefined

[Killed] UnaryOperator
Harish/testing/src/lilypond.js:444:31
                         targetDuration = 1 / 2.0;
                         tupletDuration = 1 / 2.0;
                         totalTupletDuration = (isComplete) ? 1 / (2 * 4)
-                            : -1;
+                            : +1;
 
                         if (arr[0] > commonTupletNote) {
killedBy: processLilypondNotes, when typeof obj != string word[4] > 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuplet 1/2 { } 
+ \tuple 1/1 { } \tuple 1/1 { } \tuple 1/1 { }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:446:29
                         totalTupletDuration = (isComplete) ? 1 / (2 * 4)
                             : -1;
 
-                        if (arr[0] > commonTupletNote) {
+                        if (true) {
                             f = div(arr[0], commonTupletNote)
                             commonTupletNote = arr[0];
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+ \tuple 16/1 { } \tuple 16/1 { } \tuple 16/1 { }

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:446:29
                         totalTupletDuration = (isComplete) ? 1 / (2 * 4)
                             : -1;
 
-                        if (arr[0] > commonTupletNote) {
+                        if (arr[0] <= commonTupletNote) {
                             f = div(arr[0], commonTupletNote)
                             commonTupletNote = arr[0];
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+ \tuple 16/1 { } \tuple 16/1 { } \tuple 16/1 { }

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:455:32
 
                         let j = 1;
                         let k = 1;
-                        while (k < arr[0] * arr[1]) {
+                        while (k <= arr[0] * arr[1]) {
                             if (word[3] === "tie") {
                                 // console.debug("saw a tie");
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] = 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuplet 1/2 { } \tuplet 1/2 { } \tuplet 1/2 { } 
+ \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { }

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:455:32
 
                         let j = 1;
                         let k = 1;
-                        while (k < arr[0] * arr[1]) {
+                        while (k >= arr[0] * arr[1]) {
                             if (word[3] === "tie") {
                                 // console.debug("saw a tie");
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+ \tuplet 1/2 { }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:456:33
                         let j = 1;
                         let k = 1;
                         while (k < arr[0] * arr[1]) {
-                            if (word[3] === "tie") {
+                            if (true) {
                                 // console.debug("saw a tie");
                                 k = increment(k); // Increment notes in tuplet.
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+ \tuplet 1/2 { }

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:456:33
                         let j = 1;
                         let k = 1;
                         while (k < arr[0] * arr[1]) {
-                            if (word[3] === "tie") {
+                            if (word[3] !== "tie") {
                                 // console.debug("saw a tie");
                                 k = increment(k); // Increment notes in tuplet.
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+ \tuplet 1/2 { }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:460:40
                                 // console.debug("saw a tie");
                                 k = increment(k); // Increment notes in tuplet.
                                 j = increment(j);
-                            } else if ([1, 0.5, 0.25, 0.125, 0.0625].indexOf(totalTupletDuration) !== -1) {
+                            } else if (true) {
                                 // Break up tuplet on POW2 values
                                 incompleteTuplet = j;
killedBy: processLilypondNotes, when typeof obj != string word[4] > 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuplet 1/2 { } 
+ \tuple -2/2 { } \tuple -2/2 { } \tuple -2/2 { }

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:460:40
                                 // console.debug("saw a tie");
                                 k = increment(k); // Increment notes in tuplet.
                                 j = increment(j);
-                            } else if ([1, 0.5, 0.25, 0.125, 0.0625].indexOf(totalTupletDuration) !== -1) {
+                            } else if ([1, 0.5, 0.25, 0.125, 0.0625].indexOf(totalTupletDuration) === -1) {
                                 // Break up tuplet on POW2 values
                                 incompleteTuplet = j;
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: TypeError: Cannot read property '0' of undefined

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:465:33
                                 incompleteTuplet = j;
                                 break;
                             } else if (
-                                word[3] === null
+                                true
                             ) {
                                 incompleteTuplet = j;
killedBy: processLilypondNotes, when typeof obj != string word[4] > 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuplet 1/2 { } 
+ \tuple -2/2 { } \tuple -2/2 { } \tuple -2/2 { }

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:465:33
                                 incompleteTuplet = j;
                                 break;
                             } else if (
-                                word[3] === null
+                                word[3] !== null
                             ) {
                                 incompleteTuplet = j;
killedBy: processLilypondNotes, when typeof obj != string word[4] > 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuplet 1/2 { } 
+ \tuple -2/2 { } \tuple -2/2 { } \tuple -2/2 { }

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:466:31
                                 break;
                             } else if (
                                 word[3] === null
-                            ) {
-                                incompleteTuplet = j;
-                                break;
-                            } 
+                            ) {} 
                             else if (
                                 word[3][0] !==

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:471:33
                                 break;
                             } 
                             else if (
-                                word[3][0] !==
-                                arr[0]
+                                word[3][0] === arr[0]
                             ) {
                                 // Match if sharing same factor, e.g., 1/3, 1/6, 1/12
killedBy: processLilypondNotes, when typeof obj != string word[4] > 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuplet 1/2 { } 
+ \tuple -2/2 { } \tuple -2/2 { } \tuple -2/2 { }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:471:33
                                 break;
                             } 
                             else if (
-                                word[3][0] !==
-                                arr[0]
+                                true
                             ) {
                                 // Match if sharing same factor, e.g., 1/3, 1/6, 1/12
killedBy: processLilypondNotes, when typeof obj != string word[4] > 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuplet 1/2 { } 
+ \tuple -2/2 { } \tuple -2/2 { } \tuple -2/2 { }

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:473:31
                             else if (
                                 word[3][0] !==
                                 arr[0]
-                            ) {
-                                // Match if sharing same factor, e.g., 1/3, 1/6, 1/12
-                                incompleteTuplet = j;
-                                break;
-                            } 
+                            ) {} 
                             else {
                                 

[Timeout] BlockStatement
Harish/testing/src/lilypond.js:478:34
                                 incompleteTuplet = j;
                                 break;
                             } 
-                            else {
-                                
-                                tupletNoteCounter = computeCounter(tupletNoteCounter, word[4])
-                                if (word[4] > 5) { break; }
-                                targetDuration +=
-                                    div(1, word[1]);
-                                tupletDuration +=
-                                    div(1, word[4]);
-                                totalTupletDuration +=
-                                    div(1, (div(word[3][0], div(1, word[3][1]))));
-                                j = increment(j); // Jump to next note.
-                                k = increment(k); // Increment notes in tuplet.
-                            }
+                            else {}
                         }
                     }

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:481:37
                             else {
                                 
                                 tupletNoteCounter = computeCounter(tupletNoteCounter, word[4])
-                                if (word[4] > 5) { break; }
+                                if (word[4] >= 5) { break; }
                                 targetDuration +=
                                     div(1, word[1]);
killedBy: processLilypondNotes, when typeof obj != string word[4] = 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuplet 1/1 { } 
+ \tuplet 1/2 { }
