[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:481:37
                             else {
                                 
                                 tupletNoteCounter = computeCounter(tupletNoteCounter, word[4])
-                                if (word[4] > 5) { break; }
+                                if (false) { break; }
                                 targetDuration +=
                                     div(1, word[1]);
killedBy: processLilypondNotes, when typeof obj != string word[4] > 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuplet 1/2 { } 
+ \tuplet 1/1 { }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:495:25
                     }
 
                     if (
-                        arr[0] != null &&
-                        arr[0] * arr[1] > 0
+                        false
                     ) {
                         // Lilypond tuplets look like this: \tuplet 3/2 { f8 g a }
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+  \staccato  \staccato  \staccato

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:495:25
                     }
 
                     if (
-                        arr[0] != null &&
+                        false &&
                         arr[0] * arr[1] > 0
                     ) {
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+  \staccato  \staccato  \staccato

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:496:25
 
                     if (
                         arr[0] != null &&
-                        arr[0] * arr[1] > 0
+                        false
                     ) {
                         // Lilypond tuplets look like this: \tuplet 3/2 { f8 g a }
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+  \staccato  \staccato  \staccato

[Timeout] EqualityOperator
Harish/testing/src/lilypond.js:496:25
 
                     if (
                         arr[0] != null &&
-                        arr[0] * arr[1] > 0
+                        arr[0] * arr[1] <= 0
                     ) {
                         // Lilypond tuplets look like this: \tuplet 3/2 { f8 g a }

[Killed] BlockStatement
Harish/testing/src/lilypond.js:502:53
                         // multiplier = tupletDuration / targetDuration
                         // e.g., (3/8) / (1/4) = (3/8) * 4 = 12/8 = 3/2
 
-                        if (incompleteTuplet === 0) {
-                            const tupletFraction = toFraction(div(tupletDuration, targetDuration));
-                            let a = tupletFraction[0] * targetDuration;
-                            let b = div(tupletFraction[0], div(1, tupletFraction[1]));
-                            let c;
-
-                            if (Math.floor(a) !== a) {
-                                c = toFraction(div(a, 1));
-                                a = c[0];
-                                b = c[1];
-                            }
-
-                            logo.notationNotes[turtle] += "\\tuplet " + a + "/" + b + " { ";
-
-                            i +=
-                                __processTuplet(
-                                    logo,
-                                    turtle,
-                                    i,
-                                    arr[0] * arr[1]
-                                ) - 1;
-                        } else {
+                        if (incompleteTuplet === 0) {} else {
                             // Incomplete tuplets look like this: \tuplet 3/2 { f4 a8 }
                             // for 1/6 1/12
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] = 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuplet 1/2 { } \tuplet 1/2 { } \tuplet 1/2 { } 
+

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:502:29
                         // multiplier = tupletDuration / targetDuration
                         // e.g., (3/8) / (1/4) = (3/8) * 4 = 12/8 = 3/2
 
-                        if (incompleteTuplet === 0) {
+                        if (true) {
                             const tupletFraction = toFraction(div(tupletDuration, targetDuration));
                             let a = tupletFraction[0] * targetDuration;
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+ \tuplet 1/2 { }

[Killed] ArithmeticOperator
Harish/testing/src/lilypond.js:504:37
 
                         if (incompleteTuplet === 0) {
                             const tupletFraction = toFraction(div(tupletDuration, targetDuration));
-                            let a = tupletFraction[0] * targetDuration;
+                            let a = tupletFraction[0] / targetDuration;
                             let b = div(tupletFraction[0], div(1, tupletFraction[1]));
                             let c;
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] = 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuplet 1/2 { } \tuplet 1/2 { } \tuplet 1/2 { } 
+ \tuplet 2/1 { } \tuplet 2/1 { } \tuplet 2/1 { }

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:508:33
                             let b = div(tupletFraction[0], div(1, tupletFraction[1]));
                             let c;
 
-                            if (Math.floor(a) !== a) {
+                            if (Math.floor(a) === a) {
                                 c = toFraction(div(a, 1));
                                 a = c[0];
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] = 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuplet 1/2 { } \tuplet 1/2 { } \tuplet 1/2 { } 
+ \tuplet 0.5/1 { } \tuplet 0.5/1 { } \tuplet 0.5/1 { }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:508:33
                             let b = div(tupletFraction[0], div(1, tupletFraction[1]));
                             let c;
 
-                            if (Math.floor(a) !== a) {
+                            if (false) {
                                 c = toFraction(div(a, 1));
                                 a = c[0];
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] = 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuplet 1/2 { } \tuplet 1/2 { } \tuplet 1/2 { } 
+ \tuplet 0.5/1 { } \tuplet 0.5/1 { } \tuplet 0.5/1 { }

[Killed] StringLiteral
Harish/testing/src/lilypond.js:514:59
                                 b = c[1];
                             }
 
-                            logo.notationNotes[turtle] += "\\tuplet " + a + "/" + b + " { ";
+                            logo.notationNotes[turtle] += "" + a + "/" + b + " { ";
 
                             i +=
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] = 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuplet 1/2 { } \tuplet 1/2 { } \tuplet 1/2 { } 
+ 1/2 { } 1/2 { } 1/2 { }

[Killed] StringLiteral
Harish/testing/src/lilypond.js:514:77
                                 b = c[1];
                             }
 
-                            logo.notationNotes[turtle] += "\\tuplet " + a + "/" + b + " { ";
+                            logo.notationNotes[turtle] += "\\tuplet " + a + "" + b + " { ";
 
                             i +=
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] = 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuplet 1/2 { } \tuplet 1/2 { } \tuplet 1/2 { } 
+ \tuplet 12 { } \tuplet 12 { } \tuplet 12 { }

[Killed] ArithmeticOperator
Harish/testing/src/lilypond.js:517:33
                             logo.notationNotes[turtle] += "\\tuplet " + a + "/" + b + " { ";
 
                             i +=
-                                __processTuplet(
-                                    logo,
-                                    turtle,
-                                    i,
-                                    arr[0] * arr[1]
-                                ) - 1;
+                                __processTuplet(logo, turtle, i, arr[0] * arr[1]) + 1;
                         } else {
                             // Incomplete tuplets look like this: \tuplet 3/2 { f4 a8 }
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] = 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuplet 1/2 { } \tuplet 1/2 { } \tuplet 1/2 { } 
+ \tuplet 1/2 { }

[Killed] ArithmeticOperator
Harish/testing/src/lilypond.js:521:37
                                     logo,
                                     turtle,
                                     i,
-                                    arr[0] * arr[1]
+                                    arr[0] / arr[1]
                                 ) - 1;
                         } else {
killedBy: processLilypondNotes, when typeof obj != string word[3] == tie
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuplet 1/2 { } 
+ \tuplet 1/2 { } \tuplet 1/2 { } \tuplet 1/2 { }

[Killed] BlockStatement
Harish/testing/src/lilypond.js:523:32
                                     i,
                                     arr[0] * arr[1]
                                 ) - 1;
-                        } else {
-                            // Incomplete tuplets look like this: \tuplet 3/2 { f4 a8 }
-                            // for 1/6 1/12
-                            // duration = 1/6 + 1/12 ==> 1/4
-                            // 3 x 1/8 note in the time of a 1/4 note ==>
-                            // 3/8 / 1/4 = 3/2
-
-                            const f = tupletNoteCounter / commonTupletNote / totalTupletDuration;
-                            const tupletFraction = toFraction(f);
-                            let a = tupletFraction[0];
-                            let b = tupletFraction[1];
-                            let c;
-                            if (Math.floor(a) !== a) {
-                                c = toFraction(div(a, 1));
-                                a = c[0];
-                                b = c[1];
-                            }
-
-                            logo.notationNotes[turtle] += "\\tuple " + a + "/" + b + " { ";
-
-                            i += __processTuplet(logo, turtle, i, incompleteTuplet) - 1;
-                        }
+                        } else {}
 
                         targetDuration = 0;
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+

[Killed] ArithmeticOperator
Harish/testing/src/lilypond.js:530:39
                             // 3 x 1/8 note in the time of a 1/4 note ==>
                             // 3/8 / 1/4 = 3/2
 
-                            const f = tupletNoteCounter / commonTupletNote / totalTupletDuration;
+                            const f = tupletNoteCounter / commonTupletNote * totalTupletDuration;
                             const tupletFraction = toFraction(f);
                             let a = tupletFraction[0];
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+ \tuple 1/8 { } \tuple 1/8 { } \tuple 1/8 { }

[Killed] ArithmeticOperator
Harish/testing/src/lilypond.js:530:39
                             // 3 x 1/8 note in the time of a 1/4 note ==>
                             // 3/8 / 1/4 = 3/2
 
-                            const f = tupletNoteCounter / commonTupletNote / totalTupletDuration;
+                            const f = tupletNoteCounter * commonTupletNote / totalTupletDuration;
                             const tupletFraction = toFraction(f);
                             let a = tupletFraction[0];
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] > 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 12/1 { } \tuple 12/1 { } \tuple 12/1 { } 
+ \tuple 48/1 { } \tuple 48/1 { } \tuple 48/1 { }

[Survived] ConditionalExpression
Harish/testing/src/lilypond.js:535:33
                             let a = tupletFraction[0];
                             let b = tupletFraction[1];
                             let c;
-                            if (Math.floor(a) !== a) {
+                            if (false) {
                                 c = toFraction(div(a, 1));
                                 a = c[0];

[Survived] EqualityOperator
Harish/testing/src/lilypond.js:535:33
                             let a = tupletFraction[0];
                             let b = tupletFraction[1];
                             let c;
-                            if (Math.floor(a) !== a) {
+                            if (Math.floor(a) === a) {
                                 c = toFraction(div(a, 1));
                                 a = c[0];

[Killed] ArithmeticOperator
Harish/testing/src/lilypond.js:543:34
 
                             logo.notationNotes[turtle] += "\\tuple " + a + "/" + b + " { ";
 
-                            i += __processTuplet(logo, turtle, i, incompleteTuplet) - 1;
+                            i += __processTuplet(logo, turtle, i, incompleteTuplet) + 1;
                         }
 
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+ \tuple 8/1 { }

[Killed] BlockStatement
Harish/testing/src/lilypond.js:549:56
                         targetDuration = 0;
                         tupletDuration = 0;
                     } else {
-                        if (typeof notes === "object") {
-                            if (notes.length > 1) {
-                                logo.notationNotes[turtle] += "< note ";
-                            }
-
-                            for (let ii = 0; ii < notes.length; ii++) {
-                                logo.notationNotes[turtle] += __toLilynote(notes[ii]);
-                                if (ii < notes.length - 1) {
-                                    logo.notationNotes[turtle] += " ";
-                                }
-                            }
-
-                            if (notes.length > 1) {
-                                logo.notationNotes[turtle] += ">";
-                            }
-
-                            logo.notationNotes[turtle] += obj[1];
-                            for (let d = 0; d < obj[1]; d++) {
-                                logo.notationNotes[turtle] += ".";
-                            }
-
-                        }
+                        if (typeof notes === "object") {}
                         logo.notationNotes[turtle] += " ";
 
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] <= 0, typeof notes == obj, arr[1] = 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato 
+  \staccato  \staccato  \staccato

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:549:29
                         targetDuration = 0;
                         tupletDuration = 0;
                     } else {
-                        if (typeof notes === "object") {
+                        if (false) {
                             if (notes.length > 1) {
                                 logo.notationNotes[turtle] += "< note ";
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] <= 0, typeof notes == obj, arr[1] = 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato 
+  \staccato  \staccato  \staccato

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:550:33
                         tupletDuration = 0;
                     } else {
                         if (typeof notes === "object") {
-                            if (notes.length > 1) {
+                            if (true) {
                                 logo.notationNotes[turtle] += "< note ";
                             }
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] <= 0, typeof notes == obj, arr[1] = 3, len(notes) < 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- 2.. \staccato 2.. \staccato 2.. \staccato 
+ < note 2.. \staccato < note 2.. \staccato < note 2.. \staccato

[Killed] BlockStatement
Harish/testing/src/lilypond.js:550:51
                         tupletDuration = 0;
                     } else {
                         if (typeof notes === "object") {
-                            if (notes.length > 1) {
-                                logo.notationNotes[turtle] += "< note ";
-                            }
+                            if (notes.length > 1) {}
 
                             for (let ii = 0; ii < notes.length; ii++) {
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] <= 0, typeof notes == obj, arr[1] = 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato 
+ ''''' ''''' '''''>2.. \staccato ''''' ''''' '''''>2.. \staccato ''''' ''''' '''''>2.. \staccato

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:554:46
                                 logo.notationNotes[turtle] += "< note ";
                             }
 
-                            for (let ii = 0; ii < notes.length; ii++) {
+                            for (let ii = 0; false; ii++) {
                                 logo.notationNotes[turtle] += __toLilynote(notes[ii]);
                                 if (ii < notes.length - 1) {
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] <= 0, typeof notes == obj, arr[1] = 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato 
+ < note >2.. \staccato < note >2.. \staccato < note >2.. \staccato

[Killed] UpdateOperator
Harish/testing/src/lilypond.js:554:65
                                 logo.notationNotes[turtle] += "< note ";
                             }
 
-                            for (let ii = 0; ii < notes.length; ii++) {
+                            for (let ii = 0; ii < notes.length; ii--) {
                                 logo.notationNotes[turtle] += __toLilynote(notes[ii]);
                                 if (ii < notes.length - 1) {
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] <= 0, typeof notes == obj, arr[1] = 3
statusReason: TypeError: Cannot read property 'replace' of undefined

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:556:37
 
                             for (let ii = 0; ii < notes.length; ii++) {
                                 logo.notationNotes[turtle] += __toLilynote(notes[ii]);
-                                if (ii < notes.length - 1) {
+                                if (ii <= notes.length - 1) {
                                     logo.notationNotes[turtle] += " ";
                                 }
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] <= 0, typeof notes == obj, arr[1] = 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato 
+ < note ''''' ''''' ''''' >2.. \staccato < note ''''' ''''' ''''' >2.. \staccato < note ''''' ''''' ''''' >2.. \staccato

[Killed] ArithmeticOperator
Harish/testing/src/lilypond.js:556:42
 
                             for (let ii = 0; ii < notes.length; ii++) {
                                 logo.notationNotes[turtle] += __toLilynote(notes[ii]);
-                                if (ii < notes.length - 1) {
+                                if (ii < notes.length + 1) {
                                     logo.notationNotes[turtle] += " ";
                                 }
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] <= 0, typeof notes == obj, arr[1] = 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato 
+ < note ''''' ''''' ''''' >2.. \staccato < note ''''' ''''' ''''' >2.. \staccato < note ''''' ''''' ''''' >2.. \staccato

[Killed] BlockStatement
Harish/testing/src/lilypond.js:561:51
                                 }
                             }
 
-                            if (notes.length > 1) {
-                                logo.notationNotes[turtle] += ">";
-                            }
+                            if (notes.length > 1) {}
 
                             logo.notationNotes[turtle] += obj[1];
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] <= 0, typeof notes == obj, arr[1] = 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato 
+ < note ''''' ''''' '''''2.. \staccato < note ''''' ''''' '''''2.. \staccato < note ''''' ''''' '''''2.. \staccato

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:561:33
                                 }
                             }
 
-                            if (notes.length > 1) {
+                            if (false) {
                                 logo.notationNotes[turtle] += ">";
                             }
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] <= 0, typeof notes == obj, arr[1] = 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato 
+ < note ''''' ''''' '''''2.. \staccato < note ''''' ''''' '''''2.. \staccato < note ''''' ''''' '''''2.. \staccato

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:566:45
                             }
 
                             logo.notationNotes[turtle] += obj[1];
-                            for (let d = 0; d < obj[1]; d++) {
+                            for (let d = 0; false; d++) {
                                 logo.notationNotes[turtle] += ".";
                             }
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] <= 0, typeof notes == obj, arr[1] = 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato 
+ < note ''''' ''''' '''''>2 \staccato < note ''''' ''''' '''''>2 \staccato < note ''''' ''''' '''''>2 \staccato

[Killed] BlockStatement
Harish/testing/src/lilypond.js:566:62
                             }
 
                             logo.notationNotes[turtle] += obj[1];
-                            for (let d = 0; d < obj[1]; d++) {
-                                logo.notationNotes[turtle] += ".";
-                            }
+                            for (let d = 0; d < obj[1]; d++) {}
 
                         }
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] <= 0, typeof notes == obj, arr[1] = 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato 
+ < note ''''' ''''' '''''>2 \staccato < note ''''' ''''' '''''>2 \staccato < note ''''' ''''' '''''>2 \staccato

[Killed] StringLiteral
Harish/testing/src/lilypond.js:567:63
 
                             logo.notationNotes[turtle] += obj[1];
                             for (let d = 0; d < obj[1]; d++) {
-                                logo.notationNotes[turtle] += ".";
+                                logo.notationNotes[turtle] += "";
                             }
 
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] <= 0, typeof notes == obj, arr[1] = 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato 
+ < note ''''' ''''' '''''>2 \staccato < note ''''' ''''' '''''>2 \staccato < note ''''' ''''' '''''>2 \staccato

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:573:29
                         }
                         logo.notationNotes[turtle] += " ";
 
-                        if (arr[1] == 3) {
+                        if (true) {
                             logo.notationNotes[turtle] += "\\staccato ";
                         }
killedBy: processLilypondNotes, when typeof obj == string typeof obj[0] === string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
-    
+  \staccato  \staccato  \staccato

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:573:29
                         }
                         logo.notationNotes[turtle] += " ";
 
-                        if (arr[1] == 3) {
+                        if (false) {
                             logo.notationNotes[turtle] += "\\staccato ";
                         }
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] <= 0, typeof notes != obj, arr[1] = 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
-  \staccato  \staccato  \staccato 
+

[Killed] StringLiteral
Harish/testing/src/lilypond.js:574:59
                         logo.notationNotes[turtle] += " ";
 
                         if (arr[1] == 3) {
-                            logo.notationNotes[turtle] += "\\staccato ";
+                            logo.notationNotes[turtle] += "";
                         }
 
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] <= 0, typeof notes != obj, arr[1] = 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
-  \staccato  \staccato  \staccato 
+

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:581:21
                         tupletDuration = 0;
                     }
                 }
-                if (articulation) {
+                if (true) {
                     logo.notationNotes[turtle] += "->";
                 }
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 3

  \meter
  \tempo swing
- \tempo swing
