[Killed] BlockStatement
Harish/testing/src/lilypond.js:581:35
                         tupletDuration = 0;
                     }
                 }
-                if (articulation) {
-                    logo.notationNotes[turtle] += "->";
-                }
+                if (articulation) {}
                 if (queueSlur) {
                     queueSlur = false;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- ->->->
+

[Killed] StringLiteral
Harish/testing/src/lilypond.js:582:51
                     }
                 }
                 if (articulation) {
-                    logo.notationNotes[turtle] += "->";
+                    logo.notationNotes[turtle] += "";
                 }
                 if (queueSlur) {
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- ->->->
+

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:584:21
                 if (articulation) {
                     logo.notationNotes[turtle] += "->";
                 }
-                if (queueSlur) {
+                if (true) {
                     queueSlur = false;
                     logo.notationNotes[turtle] += "(  ";
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 3

  \meter
  \tempo swing
- \tempo swing

[Killed] BlockStatement
Harish/testing/src/lilypond.js:584:32
                 if (articulation) {
                     logo.notationNotes[turtle] += "->";
                 }
-                if (queueSlur) {
-                    queueSlur = false;
-                    logo.notationNotes[turtle] += "(  ";
-                }
+                if (queueSlur) {}
                 // }
             }
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- (  (  (  
+

[Survived] BooleanLiteral
Harish/testing/src/lilypond.js:585:33
                     logo.notationNotes[turtle] += "->";
                 }
                 if (queueSlur) {
-                    queueSlur = false;
+                    queueSlur = true;
                     logo.notationNotes[turtle] += "(  ";
                 }

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:597:14
 
         //.TRANS Animal names used in Lilypond output
         const RODENTS = [
-            ("mouse"),
+            (""),
             ("brown rat"),
             ("mole"),

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:598:14
         //.TRANS Animal names used in Lilypond output
         const RODENTS = [
             ("mouse"),
-            ("brown rat"),
+            (""),
             ("mole"),
             ("chipmunk"),

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:600:14
             ("mouse"),
             ("brown rat"),
             ("mole"),
-            ("chipmunk"),
+            (""),
             ("red squirrel"),
             ("guinea pig"),

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:602:14
             ("mole"),
             ("chipmunk"),
             ("red squirrel"),
-            ("guinea pig"),
+            (""),
             ("capybara"),
             ("coypu"),

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:606:14
             ("capybara"),
             ("coypu"),
             ("black rat"),
-            ("grey squirrel"),
+            (""),
             ("flying squirrel"),
             ("bat")

[NoCoverage] ArrayDeclaration
Harish/testing/src/lilypond.js:611:23
             ("bat")
         ];
 
-        const CLEFS = ["treble", "bass", "bass_8", "percussion"];
+        const CLEFS = [];
 
         const NUMBERNAMES = [

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:616:13
         const NUMBERNAMES = [
             "zero",
             "one",
-            "two",
+            "",
             "three",
             "four",

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:620:13
             "three",
             "four",
             "five",
-            "six",
+            "",
             "seven",
             "eight",

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:627:26
         ];
         let turtleCount = 0;
         const clef = []; // eslint-disable-next-line no-unused-vars
-        const freygish = ""; // A place to store custom mode definitions
+        const freygish = "Stryker was here!"; // A place to store custom mode definitions
 
         turtleCount += 5

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:634:33
 
         const startDrums = turtleCount;
         // for (const t in activity.logo.notation.notationDrumStaging) {
-            for (const t in {}) {
-            // Check to see if there are any notes in the drum staging.
-            let foundNotes = false;
-            for (let i = 0; i < activity.logo.notation.notationDrumStaging[t].length; i++) {
-                const obj = activity.logo.notation.notationDrumStaging[t][i];
-                if (typeof obj === "object" && typeof obj[0] === "object" && obj[0][0] !== "R") {
-                    foundNotes = true;
-                }
-            }
-
-            if (foundNotes) {
-                activity.logo.notation.notationStaging[turtleCount.toString()] =
-                    activity.logo.notation.notationDrumStaging[t];
-            } else {
-                activity.logo.notation.notationStaging[turtleCount.toString()] = [];
-            }
-            turtleCount += 1;
-        }
+            for (const t in {}) {}
 
         // eslint-disable-next-line no-console

[NoCoverage] BooleanLiteral
Harish/testing/src/lilypond.js:636:30
         // for (const t in activity.logo.notation.notationDrumStaging) {
             for (const t in {}) {
             // Check to see if there are any notes in the drum staging.
-            let foundNotes = false;
+            let foundNotes = true;
             for (let i = 0; i < activity.logo.notation.notationDrumStaging[t].length; i++) {
                 const obj = activity.logo.notation.notationDrumStaging[t][i];

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:637:29
             for (const t in {}) {
             // Check to see if there are any notes in the drum staging.
             let foundNotes = false;
-            for (let i = 0; i < activity.logo.notation.notationDrumStaging[t].length; i++) {
+            for (let i = 0; false; i++) {
                 const obj = activity.logo.notation.notationDrumStaging[t][i];
                 if (typeof obj === "object" && typeof obj[0] === "object" && obj[0][0] !== "R") {

[NoCoverage] EqualityOperator
Harish/testing/src/lilypond.js:637:29
             for (const t in {}) {
             // Check to see if there are any notes in the drum staging.
             let foundNotes = false;
-            for (let i = 0; i < activity.logo.notation.notationDrumStaging[t].length; i++) {
+            for (let i = 0; i >= activity.logo.notation.notationDrumStaging[t].length; i++) {
                 const obj = activity.logo.notation.notationDrumStaging[t][i];
                 if (typeof obj === "object" && typeof obj[0] === "object" && obj[0][0] !== "R") {

[NoCoverage] EqualityOperator
Harish/testing/src/lilypond.js:639:48
             let foundNotes = false;
             for (let i = 0; i < activity.logo.notation.notationDrumStaging[t].length; i++) {
                 const obj = activity.logo.notation.notationDrumStaging[t][i];
-                if (typeof obj === "object" && typeof obj[0] === "object" && obj[0][0] !== "R") {
+                if (typeof obj === "object" && typeof obj[0] !== "object" && obj[0][0] !== "R") {
                     foundNotes = true;
                 }

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:639:78
             let foundNotes = false;
             for (let i = 0; i < activity.logo.notation.notationDrumStaging[t].length; i++) {
                 const obj = activity.logo.notation.notationDrumStaging[t][i];
-                if (typeof obj === "object" && typeof obj[0] === "object" && obj[0][0] !== "R") {
+                if (typeof obj === "object" && typeof obj[0] === "object" && false) {
                     foundNotes = true;
                 }

[NoCoverage] BooleanLiteral
Harish/testing/src/lilypond.js:640:34
             for (let i = 0; i < activity.logo.notation.notationDrumStaging[t].length; i++) {
                 const obj = activity.logo.notation.notationDrumStaging[t][i];
                 if (typeof obj === "object" && typeof obj[0] === "object" && obj[0][0] !== "R") {
-                    foundNotes = true;
+                    foundNotes = false;
                 }
             }

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:644:17
                 }
             }
 
-            if (foundNotes) {
+            if (false) {
                 activity.logo.notation.notationStaging[turtleCount.toString()] =
                     activity.logo.notation.notationDrumStaging[t];

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:644:29
                 }
             }
 
-            if (foundNotes) {
-                activity.logo.notation.notationStaging[turtleCount.toString()] =
-                    activity.logo.notation.notationDrumStaging[t];
-            } else {
+            if (foundNotes) {} else {
                 activity.logo.notation.notationStaging[turtleCount.toString()] = [];
             }

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:647:20
             if (foundNotes) {
                 activity.logo.notation.notationStaging[turtleCount.toString()] =
                     activity.logo.notation.notationDrumStaging[t];
-            } else {
-                activity.logo.notation.notationStaging[turtleCount.toString()] = [];
-            }
+            } else {}
             turtleCount += 1;
         }

[NoCoverage] ArrayDeclaration
Harish/testing/src/lilypond.js:648:82
                 activity.logo.notation.notationStaging[turtleCount.toString()] =
                     activity.logo.notation.notationDrumStaging[t];
             } else {
-                activity.logo.notation.notationStaging[turtleCount.toString()] = [];
+                activity.logo.notation.notationStaging[turtleCount.toString()] = ["Stryker was here"];
             }
             turtleCount += 1;

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:657:13
         console.debug("saving as lilypond: " + turtleCount);
 
         activity.logo.notationOutput +=
-            "% You can change the MIDI instruments below to anything on this list:\n% (http://lilypond.org/doc/v2.18/documentation/notation/midi-instruments)\n\n";
+            "";
 
         let c = 0;

[NoCoverage] EqualityOperator
Harish/testing/src/lilypond.js:665:17
             for (const t in {}) {
             // console.debug('value of t: ' + t);
             let tNumber = t;
-            if (typeof t === "string") {
+            if (typeof t !== "string") {
                 tNumber = Number(t);
             }

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:665:17
             for (const t in {}) {
             // console.debug('value of t: ' + t);
             let tNumber = t;
-            if (typeof t === "string") {
+            if (true) {
                 tNumber = Number(t);
             }

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:669:17
                 tNumber = Number(t);
             }
 
-            if (activity.logo.notation.notationStaging[t].length > 0) {
+            if (false) {
                 let octaveTotal = 0;
                 let noteCount = 0;

[NoCoverage] EqualityOperator
Harish/testing/src/lilypond.js:669:17
                 tNumber = Number(t);
             }
 
-            if (activity.logo.notation.notationStaging[t].length > 0) {
+            if (activity.logo.notation.notationStaging[t].length <= 0) {
                 let octaveTotal = 0;
                 let noteCount = 0;

[NoCoverage] UpdateOperator
Harish/testing/src/lilypond.js:672:87
             if (activity.logo.notation.notationStaging[t].length > 0) {
                 let octaveTotal = 0;
                 let noteCount = 0;
-                for (let i = 0; i < activity.logo.notation.notationStaging[t].length; i++) {
+                for (let i = 0; i < activity.logo.notation.notationStaging[t].length; i--) {
                     const obj = activity.logo.notation.notationStaging[t][i];
                     // console.log("obj is ");

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:672:33
             if (activity.logo.notation.notationStaging[t].length > 0) {
                 let octaveTotal = 0;
                 let noteCount = 0;
-                for (let i = 0; i < activity.logo.notation.notationStaging[t].length; i++) {
+                for (let i = 0; false; i++) {
                     const obj = activity.logo.notation.notationStaging[t][i];
                     // console.log("obj is ");

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:676:50
                     const obj = activity.logo.notation.notationStaging[t][i];
                     // console.log("obj is ");
                     // console.log(obj);
-                    if (typeof obj === "object") {
-                        for (let ii = 0; ii < obj[0].length; ii++) {
-                            if (obj[0][ii] === "R") {
-                                continue;
-                            } else if (typeof obj[0][ii] === "string") {
-                                octaveTotal += Number(obj[0][ii].substr(-1));
-                            } else {
-                                const pitchObj = frequencyToPitch(obj[0][ii]);
-                                octaveTotal += pitchObj[1];
-                            }
-
-                            noteCount += 1;
-                        }
-                    }
+                    if (typeof obj === "object") {}
                 }
 

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:676:25
                     const obj = activity.logo.notation.notationStaging[t][i];
                     // console.log("obj is ");
                     // console.log(obj);
-                    if (typeof obj === "object") {
+                    if (true) {
                         for (let ii = 0; ii < obj[0].length; ii++) {
                             if (obj[0][ii] === "R") {

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:677:42
                     // console.log("obj is ");
                     // console.log(obj);
                     if (typeof obj === "object") {
-                        for (let ii = 0; ii < obj[0].length; ii++) {
+                        for (let ii = 0; false; ii++) {
                             if (obj[0][ii] === "R") {
                                 continue;

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:677:68
                     // console.log("obj is ");
                     // console.log(obj);
                     if (typeof obj === "object") {
-                        for (let ii = 0; ii < obj[0].length; ii++) {
-                            if (obj[0][ii] === "R") {
-                                continue;
-                            } else if (typeof obj[0][ii] === "string") {
-                                octaveTotal += Number(obj[0][ii].substr(-1));
-                            } else {
-                                const pitchObj = frequencyToPitch(obj[0][ii]);
-                                octaveTotal += pitchObj[1];
-                            }
-
-                            noteCount += 1;
-                        }
+                        for (let ii = 0; ii < obj[0].length; ii++) {}
                     }
                 }

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:678:53
                     // console.log(obj);
                     if (typeof obj === "object") {
                         for (let ii = 0; ii < obj[0].length; ii++) {
-                            if (obj[0][ii] === "R") {
-                                continue;
-                            } else if (typeof obj[0][ii] === "string") {
+                            if (obj[0][ii] === "R") {} else if (typeof obj[0][ii] === "string") {
                                 octaveTotal += Number(obj[0][ii].substr(-1));
                             } else {

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:678:33
                     // console.log(obj);
                     if (typeof obj === "object") {
                         for (let ii = 0; ii < obj[0].length; ii++) {
-                            if (obj[0][ii] === "R") {
+                            if (true) {
                                 continue;
                             } else if (typeof obj[0][ii] === "string") {

[NoCoverage] EqualityOperator
Harish/testing/src/lilypond.js:680:40
                         for (let ii = 0; ii < obj[0].length; ii++) {
                             if (obj[0][ii] === "R") {
                                 continue;
-                            } else if (typeof obj[0][ii] === "string") {
+                            } else if (typeof obj[0][ii] !== "string") {
                                 octaveTotal += Number(obj[0][ii].substr(-1));
                             } else {

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:680:40
                         for (let ii = 0; ii < obj[0].length; ii++) {
                             if (obj[0][ii] === "R") {
                                 continue;
-                            } else if (typeof obj[0][ii] === "string") {
+                            } else if (true) {
                                 octaveTotal += Number(obj[0][ii].substr(-1));
                             } else {

[NoCoverage] UnaryOperator
Harish/testing/src/lilypond.js:681:73
                             if (obj[0][ii] === "R") {
                                 continue;
                             } else if (typeof obj[0][ii] === "string") {
-                                octaveTotal += Number(obj[0][ii].substr(-1));
+                                octaveTotal += Number(obj[0][ii].substr(+1));
                             } else {
                                 const pitchObj = frequencyToPitch(obj[0][ii]);

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:682:36
                                 continue;
                             } else if (typeof obj[0][ii] === "string") {
                                 octaveTotal += Number(obj[0][ii].substr(-1));
-                            } else {
-                                const pitchObj = frequencyToPitch(obj[0][ii]);
-                                octaveTotal += pitchObj[1];
-                            }
+                            } else {}
 
                             noteCount += 1;

[NoCoverage] EqualityOperator
Harish/testing/src/lilypond.js:692:21
                     }
                 }
 
-                if (tNumber > startDrums - 1) {
+                if (tNumber <= startDrums - 1) {
                     clef.push("percussion");
                 } else if (noteCount > 0) {

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:692:47
                     }
                 }
 
-                if (tNumber > startDrums - 1) {
-                    clef.push("percussion");
-                } else if (noteCount > 0) {
+                if (tNumber > startDrums - 1) {} else if (noteCount > 0) {
                     // eslint-disable-next-line no-console
                     console.debug(

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:694:28
 
                 if (tNumber > startDrums - 1) {
                     clef.push("percussion");
-                } else if (noteCount > 0) {
+                } else if (true) {
                     // eslint-disable-next-line no-console
                     console.debug(

[NoCoverage] EqualityOperator
Harish/testing/src/lilypond.js:694:28
 
                 if (tNumber > startDrums - 1) {
                     clef.push("percussion");
-                } else if (noteCount > 0) {
+                } else if (noteCount >= 0) {
                     // eslint-disable-next-line no-console
                     console.debug(

[NoCoverage] ArithmeticOperator
Harish/testing/src/lilypond.js:697:80
                 } else if (noteCount > 0) {
                     // eslint-disable-next-line no-console
                     console.debug(
-                        octaveTotal + " " + noteCount + " " + Math.floor(0.5 + octaveTotal / noteCount)
+                        octaveTotal + " " + noteCount + " " + Math.floor(0.5 + octaveTotal * noteCount)
                     );
                     switch (Math.floor(0.5 + octaveTotal / noteCount)) {

[NoCoverage] ArithmeticOperator
Harish/testing/src/lilypond.js:697:74
                 } else if (noteCount > 0) {
                     // eslint-disable-next-line no-console
                     console.debug(
-                        octaveTotal + " " + noteCount + " " + Math.floor(0.5 + octaveTotal / noteCount)
+                        octaveTotal + " " + noteCount + " " + Math.floor(0.5 - octaveTotal / noteCount)
                     );
                     switch (Math.floor(0.5 + octaveTotal / noteCount)) {

[NoCoverage] ArithmeticOperator
Harish/testing/src/lilypond.js:699:40
                     console.debug(
                         octaveTotal + " " + noteCount + " " + Math.floor(0.5 + octaveTotal / noteCount)
                     );
-                    switch (Math.floor(0.5 + octaveTotal / noteCount)) {
+                    switch (Math.floor(0.5 - octaveTotal / noteCount)) {
                         case 0:
                         case 1:

[NoCoverage] ArithmeticOperator
Harish/testing/src/lilypond.js:699:46
                     console.debug(
                         octaveTotal + " " + noteCount + " " + Math.floor(0.5 + octaveTotal / noteCount)
                     );
-                    switch (Math.floor(0.5 + octaveTotal / noteCount)) {
+                    switch (Math.floor(0.5 + octaveTotal * noteCount)) {
                         case 0:
                         case 1:

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:702:25
                     switch (Math.floor(0.5 + octaveTotal / noteCount)) {
                         case 0:
                         case 1:
-                        case 2:
-                            clef.push("bass_8");
-                            break;
+                        case 2:
                         case 3:
                             clef.push("bass");

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:703:39
                         case 0:
                         case 1:
                         case 2:
-                            clef.push("bass_8");
+                            clef.push("");
                             break;
                         case 3:

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:705:25
                         case 2:
                             clef.push("bass_8");
                             break;
-                        case 3:
-                            clef.push("bass");
-                            break;
+                        case 3:
                         default:
                             clef.push("treble");

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:708:25
                         case 3:
                             clef.push("bass");
                             break;
-                        default:
-                            clef.push("treble");
-                            break;
+                        default:
                     }
                 } else {

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:709:39
                             clef.push("bass");
                             break;
                         default:
-                            clef.push("treble");
+                            clef.push("");
                             break;
                     }

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:712:24
                             clef.push("treble");
                             break;
                     }
-                } else {
-                    clef.push("treble");
-                }
+                } else {}
 
                 this.freygish = "";

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:713:31
                             break;
                     }
                 } else {
-                    clef.push("treble");
+                    clef.push("");
                 }
 

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:716:33
                     clef.push("treble");
                 }
 
-                this.freygish = "";
+                this.freygish = "Stryker was here!";
                 processLilypondNotes(this, activity.logo, t);
 

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:719:21
                 this.freygish = "";
                 processLilypondNotes(this, activity.logo, t);
 
-                if (this.freygish !== "") {
+                if (false) {
                     activity.logo.notationOutput += this.freygish;
                 }

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:719:43
                 this.freygish = "";
                 processLilypondNotes(this, activity.logo, t);
 
-                if (this.freygish !== "") {
-                    activity.logo.notationOutput += this.freygish;
-                }
+                if (this.freygish !== "") {}
 
                 let instrumentName = "";

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:726:47
                 let instrumentName = "";
                 let shortInstrumentName = "";
 
-                if (tNumber > startDrums - 1) {
-                    instrumentName = _("drum") + NUMBERNAMES[tNumber - startDrums];
-                    instrumentName = instrumentName.replace(/ /g, "").replace(".", "");
-                    activity.logo.notationOutput += instrumentName + " = {\n";
-                    activity.logo.notationOutput += "\\drummode {\n";
-                    activity.logo.notationOutput += activity.logo.notationNotes[t];
-                    // Add bar to last turtle's output.
-                    if (c === turtleCount - 1) {
-                        activity.logo.notationOutput += ' \\bar "|."';
-                    }
-
-                    activity.logo.notationOutput += "\n}\n";
-                    activity.logo.notationOutput += "\n}\n\n";
-                } else {
+                if (tNumber > startDrums - 1) {} else {
                     if (t in activity.turtles.turtleList) {
                         // const turtleNumber = tNumber;

[NoCoverage] ArithmeticOperator
Harish/testing/src/lilypond.js:727:38
                 let shortInstrumentName = "";
 
                 if (tNumber > startDrums - 1) {
-                    instrumentName = _("drum") + NUMBERNAMES[tNumber - startDrums];
+                    instrumentName = _("drum") - NUMBERNAMES[tNumber - startDrums];
                     instrumentName = instrumentName.replace(/ /g, "").replace(".", "");
                     activity.logo.notationOutput += instrumentName + " = {\n";

[NoCoverage] ArithmeticOperator
Harish/testing/src/lilypond.js:727:62
                 let shortInstrumentName = "";
 
                 if (tNumber > startDrums - 1) {
-                    instrumentName = _("drum") + NUMBERNAMES[tNumber - startDrums];
+                    instrumentName = _("drum") + NUMBERNAMES[tNumber + startDrums];
                     instrumentName = instrumentName.replace(/ /g, "").replace(".", "");
                     activity.logo.notationOutput += instrumentName + " = {\n";

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:728:79
 
                 if (tNumber > startDrums - 1) {
                     instrumentName = _("drum") + NUMBERNAMES[tNumber - startDrums];
-                    instrumentName = instrumentName.replace(/ /g, "").replace(".", "");
+                    instrumentName = instrumentName.replace(/ /g, "").replace("", "");
                     activity.logo.notationOutput += instrumentName + " = {\n";
                     activity.logo.notationOutput += "\\drummode {\n";

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:728:67
 
                 if (tNumber > startDrums - 1) {
                     instrumentName = _("drum") + NUMBERNAMES[tNumber - startDrums];
-                    instrumentName = instrumentName.replace(/ /g, "").replace(".", "");
+                    instrumentName = instrumentName.replace(/ /g, "Stryker was here!").replace(".", "");
                     activity.logo.notationOutput += instrumentName + " = {\n";
                     activity.logo.notationOutput += "\\drummode {\n";
