[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:729:70
                 if (tNumber > startDrums - 1) {
                     instrumentName = _("drum") + NUMBERNAMES[tNumber - startDrums];
                     instrumentName = instrumentName.replace(/ /g, "").replace(".", "");
-                    activity.logo.notationOutput += instrumentName + " = {\n";
+                    activity.logo.notationOutput += instrumentName + "";
                     activity.logo.notationOutput += "\\drummode {\n";
                     activity.logo.notationOutput += activity.logo.notationNotes[t];

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:730:53
                     instrumentName = _("drum") + NUMBERNAMES[tNumber - startDrums];
                     instrumentName = instrumentName.replace(/ /g, "").replace(".", "");
                     activity.logo.notationOutput += instrumentName + " = {\n";
-                    activity.logo.notationOutput += "\\drummode {\n";
+                    activity.logo.notationOutput += "";
                     activity.logo.notationOutput += activity.logo.notationNotes[t];
                     // Add bar to last turtle's output.

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:733:25
                     activity.logo.notationOutput += "\\drummode {\n";
                     activity.logo.notationOutput += activity.logo.notationNotes[t];
                     // Add bar to last turtle's output.
-                    if (c === turtleCount - 1) {
+                    if (false) {
                         activity.logo.notationOutput += ' \\bar "|."';
                     }

[NoCoverage] EqualityOperator
Harish/testing/src/lilypond.js:733:25
                     activity.logo.notationOutput += "\\drummode {\n";
                     activity.logo.notationOutput += activity.logo.notationNotes[t];
                     // Add bar to last turtle's output.
-                    if (c === turtleCount - 1) {
+                    if (c !== turtleCount - 1) {
                         activity.logo.notationOutput += ' \\bar "|."';
                     }

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:740:25
                     activity.logo.notationOutput += "\n}\n";
                     activity.logo.notationOutput += "\n}\n\n";
                 } else {
-                    if (t in activity.turtles.turtleList) {
+                    if (false) {
                         // const turtleNumber = tNumber;
 

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:740:25
                     activity.logo.notationOutput += "\n}\n";
                     activity.logo.notationOutput += "\n}\n\n";
                 } else {
-                    if (t in activity.turtles.turtleList) {
+                    if (true) {
                         // const turtleNumber = tNumber;
 

[NoCoverage] EqualityOperator
Harish/testing/src/lilypond.js:744:29
                         // const turtleNumber = tNumber;
 
                         instrumentName = activity.turtles.turtleList[t].name;
-                        if (instrumentName === _("start") || instrumentName === _("start drum")) {
+                        if (instrumentName !== _("start") || instrumentName === _("start drum")) {
                             instrumentName = RODENTS[tNumber % 12];
                         } else if (instrumentName === tNumber.toString()) {

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:744:29
                         // const turtleNumber = tNumber;
 
                         instrumentName = activity.turtles.turtleList[t].name;
-                        if (instrumentName === _("start") || instrumentName === _("start drum")) {
+                        if (true) {
                             instrumentName = RODENTS[tNumber % 12];
                         } else if (instrumentName === tNumber.toString()) {

[NoCoverage] ArithmeticOperator
Harish/testing/src/lilypond.js:745:54
 
                         instrumentName = activity.turtles.turtleList[t].name;
                         if (instrumentName === _("start") || instrumentName === _("start drum")) {
-                            instrumentName = RODENTS[tNumber % 12];
+                            instrumentName = RODENTS[tNumber * 12];
                         } else if (instrumentName === tNumber.toString()) {
                             instrumentName = RODENTS[tNumber % 12];

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:746:75
                         instrumentName = activity.turtles.turtleList[t].name;
                         if (instrumentName === _("start") || instrumentName === _("start drum")) {
                             instrumentName = RODENTS[tNumber % 12];
-                        } else if (instrumentName === tNumber.toString()) {
-                            instrumentName = RODENTS[tNumber % 12];
-                        }
+                        } else if (instrumentName === tNumber.toString()) {}
                     }
 

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:746:36
                         instrumentName = activity.turtles.turtleList[t].name;
                         if (instrumentName === _("start") || instrumentName === _("start drum")) {
                             instrumentName = RODENTS[tNumber % 12];
-                        } else if (instrumentName === tNumber.toString()) {
+                        } else if (true) {
                             instrumentName = RODENTS[tNumber % 12];
                         }

[NoCoverage] ArithmeticOperator
Harish/testing/src/lilypond.js:747:54
                         if (instrumentName === _("start") || instrumentName === _("start drum")) {
                             instrumentName = RODENTS[tNumber % 12];
                         } else if (instrumentName === tNumber.toString()) {
-                            instrumentName = RODENTS[tNumber % 12];
+                            instrumentName = RODENTS[tNumber * 12];
                         }
                     }

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:751:25
                         }
                     }
 
-                    if (instrumentName === "") {
+                    if (false) {
                         instrumentName = RODENTS[tNumber % 12];
                     }

[NoCoverage] EqualityOperator
Harish/testing/src/lilypond.js:751:25
                         }
                     }
 
-                    if (instrumentName === "") {
+                    if (instrumentName !== "") {
                         instrumentName = RODENTS[tNumber % 12];
                     }

[NoCoverage] ArithmeticOperator
Harish/testing/src/lilypond.js:752:50
                     }
 
                     if (instrumentName === "") {
-                        instrumentName = RODENTS[tNumber % 12];
+                        instrumentName = RODENTS[tNumber * 12];
                     }
 

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:762:48
                     activity.logo.notationOutput += activity.logo.notationNotes[t];
 
                     // Add bar to last turtle's output.
-                    if (c === turtleCount - 1) {
-                        activity.logo.notationOutput += ' \\bar "|."';
-                    }
+                    if (c === turtleCount - 1) {}
 
                     activity.logo.notationOutput += "\n}\n\n";

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:768:33
 
                     activity.logo.notationOutput += "\n}\n\n";
 
-                    let final = "";
+                    let final = "Stryker was here!";
                     let firstPart = "";
                     let secondPart = "";

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:770:38
 
                     let final = "";
                     let firstPart = "";
-                    let secondPart = "";
+                    let secondPart = "Stryker was here!";
                     let part1 = "";
                     let part2 = "";

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:771:33
                     let final = "";
                     let firstPart = "";
                     let secondPart = "";
-                    let part1 = "";
+                    let part1 = "Stryker was here!";
                     let part2 = "";
                     let done = 0;

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:782:54
                     // word. Otherwise we use the first two letters of the
                     // name. If the name is not unique, we keep adding
                     // letters.
-                    if (instrumentName.length === 1) {
-                        shortInstrumentName = instrumentName;
-                        occupiedShortNames[t] = shortInstrumentName;
-                    } else if (n === -1) {
+                    if (instrumentName.length === 1) {} else if (n === -1) {
                         // no space in instrument name
                         for (let p = 2; p < instrumentName.length; p++) {

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:782:25
                     // word. Otherwise we use the first two letters of the
                     // name. If the name is not unique, we keep adding
                     // letters.
-                    if (instrumentName.length === 1) {
+                    if (false) {
                         shortInstrumentName = instrumentName;
                         occupiedShortNames[t] = shortInstrumentName;

[NoCoverage] EqualityOperator
Harish/testing/src/lilypond.js:785:32
                     if (instrumentName.length === 1) {
                         shortInstrumentName = instrumentName;
                         occupiedShortNames[t] = shortInstrumentName;
-                    } else if (n === -1) {
+                    } else if (n !== -1) {
                         // no space in instrument name
                         for (let p = 2; p < instrumentName.length; p++) {

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:785:32
                     if (instrumentName.length === 1) {
                         shortInstrumentName = instrumentName;
                         occupiedShortNames[t] = shortInstrumentName;
-                    } else if (n === -1) {
+                    } else if (true) {
                         // no space in instrument name
                         for (let p = 2; p < instrumentName.length; p++) {

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:787:41
                         occupiedShortNames[t] = shortInstrumentName;
                     } else if (n === -1) {
                         // no space in instrument name
-                        for (let p = 2; p < instrumentName.length; p++) {
+                        for (let p = 2; false; p++) {
                             if (p === 2) {
                                 final = instrumentName.slice(0, 2);

[NoCoverage] EqualityOperator
Harish/testing/src/lilypond.js:787:41
                         occupiedShortNames[t] = shortInstrumentName;
                     } else if (n === -1) {
                         // no space in instrument name
-                        for (let p = 2; p < instrumentName.length; p++) {
+                        for (let p = 2; p <= instrumentName.length; p++) {
                             if (p === 2) {
                                 final = instrumentName.slice(0, 2);

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:788:33
                     } else if (n === -1) {
                         // no space in instrument name
                         for (let p = 2; p < instrumentName.length; p++) {
-                            if (p === 2) {
+                            if (true) {
                                 final = instrumentName.slice(0, 2);
                             } else {

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:788:33
                     } else if (n === -1) {
                         // no space in instrument name
                         for (let p = 2; p < instrumentName.length; p++) {
-                            if (p === 2) {
+                            if (false) {
                                 final = instrumentName.slice(0, 2);
                             } else {

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:790:36
                         for (let p = 2; p < instrumentName.length; p++) {
                             if (p === 2) {
                                 final = instrumentName.slice(0, 2);
-                            } else {
-                                final = final + instrumentName.charAt(p - 1);
-                            }
+                            } else {}
 
                             if (occupiedShortNames.indexOf(final) === -1) {

[NoCoverage] ArithmeticOperator
Harish/testing/src/lilypond.js:791:41
                             if (p === 2) {
                                 final = instrumentName.slice(0, 2);
                             } else {
-                                final = final + instrumentName.charAt(p - 1);
+                                final = final - instrumentName.charAt(p - 1);
                             }
 

[NoCoverage] ArithmeticOperator
Harish/testing/src/lilypond.js:791:71
                             if (p === 2) {
                                 final = instrumentName.slice(0, 2);
                             } else {
-                                final = final + instrumentName.charAt(p - 1);
+                                final = final + instrumentName.charAt(p + 1);
                             }
 

[NoCoverage] UnaryOperator
Harish/testing/src/lilypond.js:794:71
                                 final = final + instrumentName.charAt(p - 1);
                             }
 
-                            if (occupiedShortNames.indexOf(final) === -1) {
+                            if (occupiedShortNames.indexOf(final) === +1) {
                                 // not found in array so unique shortname
                                 shortInstrumentName = final;

[NoCoverage] EqualityOperator
Harish/testing/src/lilypond.js:794:33
                                 final = final + instrumentName.charAt(p - 1);
                             }
 
-                            if (occupiedShortNames.indexOf(final) === -1) {
+                            if (occupiedShortNames.indexOf(final) !== -1) {
                                 // not found in array so unique shortname
                                 shortInstrumentName = final;

[NoCoverage] ArithmeticOperator
Harish/testing/src/lilypond.js:804:59
                     } else {
                         // at least 1 space in instrument name
                         firstPart = instrumentName.slice(0, n);
-                        secondPart = instrumentName.slice(n + 1, instrumentName.length);
+                        secondPart = instrumentName.slice(n - 1, instrumentName.length);
                         part1 = firstPart.charAt(0);
                         part2 = secondPart.charAt(0);

[NoCoverage] ArithmeticOperator
Harish/testing/src/lilypond.js:807:33
                         secondPart = instrumentName.slice(n + 1, instrumentName.length);
                         part1 = firstPart.charAt(0);
                         part2 = secondPart.charAt(0);
-                        final = part1 + part2;
+                        final = part1 - part2;
 
                         if (occupiedShortNames.indexOf(final) === -1) {

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:809:29
                         part2 = secondPart.charAt(0);
                         final = part1 + part2;
 
-                        if (occupiedShortNames.indexOf(final) === -1) {
+                        if (true) {
                             // found unique shortname
                             shortInstrumentName = final;

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:814:36
                             shortInstrumentName = final;
                             occupiedShortNames[t] = shortInstrumentName;
                             done = 1;
-                        } else if (done !== 1) {
+                        } else if (false) {
                             final = "";
                             for (let q = 1; q < instrumentName.length; q++) {

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:814:36
                             shortInstrumentName = final;
                             occupiedShortNames[t] = shortInstrumentName;
                             done = 1;
-                        } else if (done !== 1) {
+                        } else if (true) {
                             final = "";
                             for (let q = 1; q < instrumentName.length; q++) {

[NoCoverage] EqualityOperator
Harish/testing/src/lilypond.js:816:45
                             done = 1;
                         } else if (done !== 1) {
                             final = "";
-                            for (let q = 1; q < instrumentName.length; q++) {
+                            for (let q = 1; q <= instrumentName.length; q++) {
                                 part2 = part2 + secondPart.charAt(q);
                                 final = part1 + part2;

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:816:77
                             done = 1;
                         } else if (done !== 1) {
                             final = "";
-                            for (let q = 1; q < instrumentName.length; q++) {
-                                part2 = part2 + secondPart.charAt(q);
-                                final = part1 + part2;
-                                if (occupiedShortNames.indexOf(final) === -1) {
-                                    // found unique shortname
-                                    shortInstrumentName = final;
-                                    occupiedShortNames[t] = shortInstrumentName;
-                                    break;
-                                } else {
-                                    part1 = part1 + firstPart.charAt(q);
-                                    final = part1 + part2;
-                                    if (occupiedShortNames.indexOf(final) === -1) {
-                                        // found unique shortname
-                                        shortInstrumentName = final;
-                                        occupiedShortNames[t] = shortInstrumentName;
-                                        break;
-                                    }
-                                }
-                            }
+                            for (let q = 1; q < instrumentName.length; q++) {}
                         }
                     }

[NoCoverage] ArithmeticOperator
Harish/testing/src/lilypond.js:817:41
                         } else if (done !== 1) {
                             final = "";
                             for (let q = 1; q < instrumentName.length; q++) {
-                                part2 = part2 + secondPart.charAt(q);
+                                part2 = part2 - secondPart.charAt(q);
                                 final = part1 + part2;
                                 if (occupiedShortNames.indexOf(final) === -1) {

[NoCoverage] ArithmeticOperator
Harish/testing/src/lilypond.js:818:41
                             final = "";
                             for (let q = 1; q < instrumentName.length; q++) {
                                 part2 = part2 + secondPart.charAt(q);
-                                final = part1 + part2;
+                                final = part1 - part2;
                                 if (occupiedShortNames.indexOf(final) === -1) {
                                     // found unique shortname

[NoCoverage] EqualityOperator
Harish/testing/src/lilypond.js:819:37
                             for (let q = 1; q < instrumentName.length; q++) {
                                 part2 = part2 + secondPart.charAt(q);
                                 final = part1 + part2;
-                                if (occupiedShortNames.indexOf(final) === -1) {
+                                if (occupiedShortNames.indexOf(final) !== -1) {
                                     // found unique shortname
                                     shortInstrumentName = final;

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:819:79
                             for (let q = 1; q < instrumentName.length; q++) {
                                 part2 = part2 + secondPart.charAt(q);
                                 final = part1 + part2;
-                                if (occupiedShortNames.indexOf(final) === -1) {
-                                    // found unique shortname
-                                    shortInstrumentName = final;
-                                    occupiedShortNames[t] = shortInstrumentName;
-                                    break;
-                                } else {
+                                if (occupiedShortNames.indexOf(final) === -1) {} else {
                                     part1 = part1 + firstPart.charAt(q);
                                     final = part1 + part2;

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:824:40
                                     shortInstrumentName = final;
                                     occupiedShortNames[t] = shortInstrumentName;
                                     break;
-                                } else {
-                                    part1 = part1 + firstPart.charAt(q);
-                                    final = part1 + part2;
-                                    if (occupiedShortNames.indexOf(final) === -1) {
-                                        // found unique shortname
-                                        shortInstrumentName = final;
-                                        occupiedShortNames[t] = shortInstrumentName;
-                                        break;
-                                    }
-                                }
+                                } else {}
                             }
                         }

[NoCoverage] ArithmeticOperator
Harish/testing/src/lilypond.js:825:45
                                     occupiedShortNames[t] = shortInstrumentName;
                                     break;
                                 } else {
-                                    part1 = part1 + firstPart.charAt(q);
+                                    part1 = part1 - firstPart.charAt(q);
                                     final = part1 + part2;
                                     if (occupiedShortNames.indexOf(final) === -1) {

[NoCoverage] ArithmeticOperator
Harish/testing/src/lilypond.js:826:45
                                     break;
                                 } else {
                                     part1 = part1 + firstPart.charAt(q);
-                                    final = part1 + part2;
+                                    final = part1 - part2;
                                     if (occupiedShortNames.indexOf(final) === -1) {
                                         // found unique shortname

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:827:83
                                 } else {
                                     part1 = part1 + firstPart.charAt(q);
                                     final = part1 + part2;
-                                    if (occupiedShortNames.indexOf(final) === -1) {
-                                        // found unique shortname
-                                        shortInstrumentName = final;
-                                        occupiedShortNames[t] = shortInstrumentName;
-                                        break;
-                                    }
+                                    if (occupiedShortNames.indexOf(final) === -1) {}
                                 }
                             }

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:842:101
                     // console.debug("shortInstrumentName: " + shortInstrumentName);
                 }
 
-                activity.logo.notationOutput += instrumentName.replace(/ /g, "").replace(".", "") + "Voice = ";
+                activity.logo.notationOutput += instrumentName.replace(/ /g, "").replace(".", "") + "";
                 if (tNumber > startDrums - 1) {
                     activity.logo.notationOutput += "\\new DrumStaff \\with {\n";

[NoCoverage] ArithmeticOperator
Harish/testing/src/lilypond.js:843:31
                 }
 
                 activity.logo.notationOutput += instrumentName.replace(/ /g, "").replace(".", "") + "Voice = ";
-                if (tNumber > startDrums - 1) {
+                if (tNumber > startDrums + 1) {
                     activity.logo.notationOutput += "\\new DrumStaff \\with {\n";
                 } else {

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:843:47
                 }
 
                 activity.logo.notationOutput += instrumentName.replace(/ /g, "").replace(".", "") + "Voice = ";
-                if (tNumber > startDrums - 1) {
-                    activity.logo.notationOutput += "\\new DrumStaff \\with {\n";
-                } else {
+                if (tNumber > startDrums - 1) {} else {
                     activity.logo.notationOutput += "\\new Staff \\with {\n";
                 }

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:845:24
                 activity.logo.notationOutput += instrumentName.replace(/ /g, "").replace(".", "") + "Voice = ";
                 if (tNumber > startDrums - 1) {
                     activity.logo.notationOutput += "\\new DrumStaff \\with {\n";
-                } else {
-                    activity.logo.notationOutput += "\\new Staff \\with {\n";
-                }
+                } else {}
                 activity.logo.notationOutput += '   \\clef "' + last(clef) + '"\n';
                 activity.logo.notationOutput += '   instrumentName = "' + instrumentName + '"\n';

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:850:21
                 }
                 activity.logo.notationOutput += '   \\clef "' + last(clef) + '"\n';
                 activity.logo.notationOutput += '   instrumentName = "' + instrumentName + '"\n';
-                if (tNumber > startDrums - 1) {
+                if (false) {
                     const num = tNumber - startDrums;
                     // console.debug("shortInstrumentName = d" + num);

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:850:47
                 }
                 activity.logo.notationOutput += '   \\clef "' + last(clef) + '"\n';
                 activity.logo.notationOutput += '   instrumentName = "' + instrumentName + '"\n';
-                if (tNumber > startDrums - 1) {
-                    const num = tNumber - startDrums;
-                    // console.debug("shortInstrumentName = d" + num);
-                    activity.logo.notationOutput += '   shortInstrumentName = "' + "d" + num + '"\n';
-                    activity.logo.notationOutput += '   midiInstrument = "snare drum"\n';
-                } else {
+                if (tNumber > startDrums - 1) {} else {
                     activity.logo.notationOutput += '   shortInstrumentName = "' + shortInstrumentName + '"\n';
                     activity.logo.notationOutput += '   midiInstrument = "acoustic grand"\n';

[NoCoverage] ArithmeticOperator
Harish/testing/src/lilypond.js:851:33
                 activity.logo.notationOutput += '   \\clef "' + last(clef) + '"\n';
                 activity.logo.notationOutput += '   instrumentName = "' + instrumentName + '"\n';
                 if (tNumber > startDrums - 1) {
-                    const num = tNumber - startDrums;
+                    const num = tNumber + startDrums;
                     // console.debug("shortInstrumentName = d" + num);
                     activity.logo.notationOutput += '   shortInstrumentName = "' + "d" + num + '"\n';

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:855:24
                     // console.debug("shortInstrumentName = d" + num);
                     activity.logo.notationOutput += '   shortInstrumentName = "' + "d" + num + '"\n';
                     activity.logo.notationOutput += '   midiInstrument = "snare drum"\n';
-                } else {
-                    activity.logo.notationOutput += '   shortInstrumentName = "' + shortInstrumentName + '"\n';
-                    activity.logo.notationOutput += '   midiInstrument = "acoustic grand"\n';
-                }
+                } else {}
                 // Automatic note splitting

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:856:106
                     activity.logo.notationOutput += '   shortInstrumentName = "' + "d" + num + '"\n';
                     activity.logo.notationOutput += '   midiInstrument = "snare drum"\n';
                 } else {
-                    activity.logo.notationOutput += '   shortInstrumentName = "' + shortInstrumentName + '"\n';
+                    activity.logo.notationOutput += '   shortInstrumentName = "' + shortInstrumentName + "";
                     activity.logo.notationOutput += '   midiInstrument = "acoustic grand"\n';
                 }
