[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:857:53
                     activity.logo.notationOutput += '   midiInstrument = "snare drum"\n';
                 } else {
                     activity.logo.notationOutput += '   shortInstrumentName = "' + shortInstrumentName + '"\n';
-                    activity.logo.notationOutput += '   midiInstrument = "acoustic grand"\n';
+                    activity.logo.notationOutput += "";
                 }
                 // Automatic note splitting

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:865:21
                 activity.logo.notationOutput +=
                     '\n} { \\clef "' +
                     last(clef) +
-                    '" \\' +
+                    "" +
                     instrumentName.replace(/ /g, "").replace(".", "") +
                     " }\n\n";

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:868:20
                     '" \\' +
                     instrumentName.replace(/ /g, "").replace(".", "") +
                     " }\n\n";
-            } else {
-                clef.push("");
-            }
+            } else {}
 
             c += 1;

[NoCoverage] UpdateOperator
Harish/testing/src/lilypond.js:880:43
         activity.logo.notationOutput += "   <<\n";
 
         // Sort the staffs, treble on top, bass_8 on the bottom.
-        for (let c = 0; c < CLEFS.length; c++) {
+        for (let c = 0; c < CLEFS.length; c--) {
             // const i = 0;
             let instrumentName;

[NoCoverage] EqualityOperator
Harish/testing/src/lilypond.js:880:25
         activity.logo.notationOutput += "   <<\n";
 
         // Sort the staffs, treble on top, bass_8 on the bottom.
-        for (let c = 0; c < CLEFS.length; c++) {
+        for (let c = 0; c >= CLEFS.length; c++) {
             // const i = 0;
             let instrumentName;

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:885:21
             let instrumentName;
             for (const t in activity.logo.notationNotes) {
                 let tNumber = t;
-                if (typeof t === "string") {
+                if (false) {
                     tNumber = Number(t);
                 }

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:889:21
                     tNumber = Number(t);
                 }
 
-                if (clef[tNumber] === CLEFS[c]) {
+                if (false) {
                     if (activity.logo.notation.notationStaging[t].length > 0) {
                         if (tNumber > startDrums - 1) {

[NoCoverage] EqualityOperator
Harish/testing/src/lilypond.js:889:21
                     tNumber = Number(t);
                 }
 
-                if (clef[tNumber] === CLEFS[c]) {
+                if (clef[tNumber] !== CLEFS[c]) {
                     if (activity.logo.notation.notationStaging[t].length > 0) {
                         if (tNumber > startDrums - 1) {

[NoCoverage] EqualityOperator
Harish/testing/src/lilypond.js:890:25
                 }
 
                 if (clef[tNumber] === CLEFS[c]) {
-                    if (activity.logo.notation.notationStaging[t].length > 0) {
+                    if (activity.logo.notation.notationStaging[t].length <= 0) {
                         if (tNumber > startDrums - 1) {
                             instrumentName = _("drum") + NUMBERNAMES[tNumber - startDrums];

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:890:25
                 }
 
                 if (clef[tNumber] === CLEFS[c]) {
-                    if (activity.logo.notation.notationStaging[t].length > 0) {
+                    if (true) {
                         if (tNumber > startDrums - 1) {
                             instrumentName = _("drum") + NUMBERNAMES[tNumber - startDrums];

[NoCoverage] EqualityOperator
Harish/testing/src/lilypond.js:891:29
 
                 if (clef[tNumber] === CLEFS[c]) {
                     if (activity.logo.notation.notationStaging[t].length > 0) {
-                        if (tNumber > startDrums - 1) {
+                        if (tNumber <= startDrums - 1) {
                             instrumentName = _("drum") + NUMBERNAMES[tNumber - startDrums];
                         } else {

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:891:55
 
                 if (clef[tNumber] === CLEFS[c]) {
                     if (activity.logo.notation.notationStaging[t].length > 0) {
-                        if (tNumber > startDrums - 1) {
-                            instrumentName = _("drum") + NUMBERNAMES[tNumber - startDrums];
-                        } else {
+                        if (tNumber > startDrums - 1) {} else {
                             if (t in activity.turtles.turtleList) {
                                 instrumentName = activity.turtles.turtleList[t].name;

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:893:32
                     if (activity.logo.notation.notationStaging[t].length > 0) {
                         if (tNumber > startDrums - 1) {
                             instrumentName = _("drum") + NUMBERNAMES[tNumber - startDrums];
-                        } else {
-                            if (t in activity.turtles.turtleList) {
-                                instrumentName = activity.turtles.turtleList[t].name;
-                            } else if (tNumber in activity.turtles.turtleList) {
-                                instrumentName = activity.turtles.turtleList[tNumber].name;
-                            } else {
-                                instrumentName = _("mouse");
-                            }
-
-                            // console.debug("Source: " + instrumentName);
-
-                            if (instrumentName === "") {
-                                instrumentName = _("mouse");
-                            }
-
-                            if (instrumentName === _("start") || instrumentName === _("start drum")) {
-                                instrumentName = RODENTS[tNumber % 12];
-                            } else if (instrumentName === tNumber.toString()) {
-                                instrumentName = RODENTS[tNumber % 12];
-                            }
-                        }
+                        } else {}
 
                         instrumentName = instrumentName.replace(/ /g, "").replace(".", "");

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:894:67
                         if (tNumber > startDrums - 1) {
                             instrumentName = _("drum") + NUMBERNAMES[tNumber - startDrums];
                         } else {
-                            if (t in activity.turtles.turtleList) {
-                                instrumentName = activity.turtles.turtleList[t].name;
-                            } else if (tNumber in activity.turtles.turtleList) {
+                            if (t in activity.turtles.turtleList) {} else if (tNumber in activity.turtles.turtleList) {
                                 instrumentName = activity.turtles.turtleList[tNumber].name;
                             } else {

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:896:40
                         } else {
                             if (t in activity.turtles.turtleList) {
                                 instrumentName = activity.turtles.turtleList[t].name;
-                            } else if (tNumber in activity.turtles.turtleList) {
+                            } else if (true) {
                                 instrumentName = activity.turtles.turtleList[tNumber].name;
                             } else {

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:896:40
                         } else {
                             if (t in activity.turtles.turtleList) {
                                 instrumentName = activity.turtles.turtleList[t].name;
-                            } else if (tNumber in activity.turtles.turtleList) {
+                            } else if (false) {
                                 instrumentName = activity.turtles.turtleList[tNumber].name;
                             } else {

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:898:36
                                 instrumentName = activity.turtles.turtleList[t].name;
                             } else if (tNumber in activity.turtles.turtleList) {
                                 instrumentName = activity.turtles.turtleList[tNumber].name;
-                            } else {
-                                instrumentName = _("mouse");
-                            }
+                            } else {}
 
                             // console.debug("Source: " + instrumentName);

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:899:52
                             } else if (tNumber in activity.turtles.turtleList) {
                                 instrumentName = activity.turtles.turtleList[tNumber].name;
                             } else {
-                                instrumentName = _("mouse");
+                                instrumentName = _("");
                             }
 

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:904:33
 
                             // console.debug("Source: " + instrumentName);
 
-                            if (instrumentName === "") {
+                            if (true) {
                                 instrumentName = _("mouse");
                             }

[NoCoverage] EqualityOperator
Harish/testing/src/lilypond.js:908:33
                                 instrumentName = _("mouse");
                             }
 
-                            if (instrumentName === _("start") || instrumentName === _("start drum")) {
+                            if (instrumentName !== _("start") || instrumentName === _("start drum")) {
                                 instrumentName = RODENTS[tNumber % 12];
                             } else if (instrumentName === tNumber.toString()) {

[NoCoverage] LogicalOperator
Harish/testing/src/lilypond.js:908:33
                                 instrumentName = _("mouse");
                             }
 
-                            if (instrumentName === _("start") || instrumentName === _("start drum")) {
+                            if (instrumentName === _("start") && instrumentName === _("start drum")) {
                                 instrumentName = RODENTS[tNumber % 12];
                             } else if (instrumentName === tNumber.toString()) {

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:910:40
 
                             if (instrumentName === _("start") || instrumentName === _("start drum")) {
                                 instrumentName = RODENTS[tNumber % 12];
-                            } else if (instrumentName === tNumber.toString()) {
+                            } else if (false) {
                                 instrumentName = RODENTS[tNumber % 12];
                             }

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:915:88
                             }
                         }
 
-                        instrumentName = instrumentName.replace(/ /g, "").replace(".", "");
+                        instrumentName = instrumentName.replace(/ /g, "").replace(".", "Stryker was here!");
                         activity.logo.notationOutput += "      \\" + instrumentName + "Voice\n";
                     }

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:915:83
                             }
                         }
 
-                        instrumentName = instrumentName.replace(/ /g, "").replace(".", "");
+                        instrumentName = instrumentName.replace(/ /g, "").replace("", "");
                         activity.logo.notationOutput += "      \\" + instrumentName + "Voice\n";
                     }

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:924:25
 
         // Add GUITAR TAB in comments.
         activity.logo.notationOutput += activity.logo.guitarOutputHead;
-        for (let c = 0; c < CLEFS.length; c++) {
+        for (let c = 0; false; c++) {
             const i = 0;
             let instrumentName;

[NoCoverage] EqualityOperator
Harish/testing/src/lilypond.js:924:25
 
         // Add GUITAR TAB in comments.
         activity.logo.notationOutput += activity.logo.guitarOutputHead;
-        for (let c = 0; c < CLEFS.length; c++) {
+        for (let c = 0; c <= CLEFS.length; c++) {
             const i = 0;
             let instrumentName;

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:933:21
                     tNumber = Number(t);
                 }
 
-                if (clef[i] === CLEFS[c]) {
+                if (false) {
                     if (activity.logo.notation.notationStaging[t].length > 0) {
                         if (tNumber > startDrums - 1) {

[NoCoverage] EqualityOperator
Harish/testing/src/lilypond.js:933:21
                     tNumber = Number(t);
                 }
 
-                if (clef[i] === CLEFS[c]) {
+                if (clef[i] !== CLEFS[c]) {
                     if (activity.logo.notation.notationStaging[t].length > 0) {
                         if (tNumber > startDrums - 1) {

[NoCoverage] EqualityOperator
Harish/testing/src/lilypond.js:934:25
                 }
 
                 if (clef[i] === CLEFS[c]) {
-                    if (activity.logo.notation.notationStaging[t].length > 0) {
+                    if (activity.logo.notation.notationStaging[t].length >= 0) {
                         if (tNumber > startDrums - 1) {
                             instrumentName = _("drum") + NUMBERNAMES[tNumber - startDrums];

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:934:25
                 }
 
                 if (clef[i] === CLEFS[c]) {
-                    if (activity.logo.notation.notationStaging[t].length > 0) {
+                    if (true) {
                         if (tNumber > startDrums - 1) {
                             instrumentName = _("drum") + NUMBERNAMES[tNumber - startDrums];

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:935:29
 
                 if (clef[i] === CLEFS[c]) {
                     if (activity.logo.notation.notationStaging[t].length > 0) {
-                        if (tNumber > startDrums - 1) {
+                        if (true) {
                             instrumentName = _("drum") + NUMBERNAMES[tNumber - startDrums];
                         } else {

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:937:32
                     if (activity.logo.notation.notationStaging[t].length > 0) {
                         if (tNumber > startDrums - 1) {
                             instrumentName = _("drum") + NUMBERNAMES[tNumber - startDrums];
-                        } else {
-                            if (t in activity.turtles.turtleList) {
-                                instrumentName = activity.turtles.turtleList[t].name;
-                            } else if (tNumber in activity.turtles.turtleList) {
-                                instrumentName = activity.turtles.turtleList[tNumber].name;
-                            } else {
-                                instrumentName = _("mouse");
-                            }
-
-                            if (instrumentName === _("start") || instrumentName === _("start drum")) {
-                                instrumentName = RODENTS[tNumber % 12];
-                            } else if (instrumentName === tNumber.toString()) {
-                                instrumentName = RODENTS[tNumber % 12];
-                            }
-                        }
+                        } else {}
 
                         instrumentName = instrumentName.replace(/ /g, "").replace(".", "");

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:946:33
                                 instrumentName = _("mouse");
                             }
 
-                            if (instrumentName === _("start") || instrumentName === _("start drum")) {
+                            if (false) {
                                 instrumentName = RODENTS[tNumber % 12];
                             } else if (instrumentName === tNumber.toString()) {

[NoCoverage] ConditionalExpression
Harish/testing/src/lilypond.js:946:33
                                 instrumentName = _("mouse");
                             }
 
-                            if (instrumentName === _("start") || instrumentName === _("start drum")) {
+                            if (false || instrumentName === _("start drum")) {
                                 instrumentName = RODENTS[tNumber % 12];
                             } else if (instrumentName === tNumber.toString()) {

[NoCoverage] EqualityOperator
Harish/testing/src/lilypond.js:948:40
 
                             if (instrumentName === _("start") || instrumentName === _("start drum")) {
                                 instrumentName = RODENTS[tNumber % 12];
-                            } else if (instrumentName === tNumber.toString()) {
+                            } else if (instrumentName !== tNumber.toString()) {
                                 instrumentName = RODENTS[tNumber % 12];
                             }

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:955:29
 
                         instrumentName = instrumentName.replace(/ /g, "").replace(".", "");
                         activity.logo.notationOutput +=
-                            '         \\context TabVoice = "' +
+                            "" +
                             instrumentName +
                             '" \\' +

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:959:29
                             instrumentName +
                             '" \\' +
                             instrumentName.replace(/ /g, "").replace(".", "") +
-                            "\n";
+                            "";
                     }
                 }

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:973:41
         activity.logo.notationOutput += activity.logo.MIDIOutput;
 
         // ADD TURTLE BLOCKS CODE HERE
-        activity.logo.notationOutput += "% MUSIC BLOCKS CODE\n";
+        activity.logo.notationOutput += "";
         activity.logo.notationOutput +=
             "% Below is the code for the Music Blocks project that generated this Lilypond file.\n%{\n\n";

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:975:13
         // ADD TURTLE BLOCKS CODE HERE
         activity.logo.notationOutput += "% MUSIC BLOCKS CODE\n";
         activity.logo.notationOutput +=
-            "% Below is the code for the Music Blocks project that generated this Lilypond file.\n%{\n\n";
+            "";
         // prepareExport() returns json-encoded project data.
         const projectData = activity.prepareExport();

[NoCoverage] StringLiteral
Harish/testing/src/lilypond.js:979:41
         // prepareExport() returns json-encoded project data.
         const projectData = activity.prepareExport();
         activity.logo.notationOutput += projectData.replace(/]],/g, "]],\n");
-        activity.logo.notationOutput += "\n%}\n\n";
+        activity.logo.notationOutput += "";
         return activity.logo.notationOutput;
     };
